[
    {
        "title":"The Shawshank Redemption",
        "url":"https:\/\/www.imdb.com\/title\/tt0111161\/",
        "rating":"9.3\/10",
        "plot":"A banker convicted of uxoricide forms a friendship over a quarter century with a hardened convict, while maintaining his innocence and trying to remain hopeful through simple compassion.",
        "director":"Frank Darabont",
        "cast":[
            "Tim Robbins",
            "Morgan Freeman",
            "Bob Gunton",
            "William Sadler",
            "Clancy Brown"
        ],
        "release_year":"1994",
        "duration":"2h 22m(142 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMDAyY2FhYjctNDc5OS00MDNlLThiMGUtY2UxYWVkNGY2ZjljXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
        "comments":[
            "Can Hollywood, usually creating things for entertainment purposes only, create art?  To create something of this nature, a director must approach it in a most meticulous manner, due to the delicacy of the process.  Such a daunting task requires an extremely capable artist with an undeniable managerial capacity and an acutely developed awareness of each element of art in their films, the most prominent; music, visuals, script, and acting. These elements, each equally important, must succeed independently, yet still form a harmonious union, because this mixture determines the fate of the artist's opus.  Though already well known amongst his colleagues for his notable skills at writing and directing, Frank Darabont emerges with his feature film directorial debut, The Shawshank Redemption.  Proving himself already a master of the craft, Darabont managed to create one of the most recognizable independent releases in the history of Hollywood.  The Shawshank Redemption defines a genre, defies the odds, compels the emotions, and brings an era of artistically influential films back to Hollywood.The story begins with the trial of a young banker, Andy Dufrense, victimized by circumstantial evidence, resulting in a conviction for the murder of his wife and her lover.  After a quick conviction, Andy finds himself serving a life sentence at Shawshank prison, with no hope of parole.  He exists in this prison only in appearance, keeping his mind free from the drab walls around him.  His ability to do this results in the gaining of respect from his fellow inmates, but most of all from Ellis Redding.  Ellis, commonly referred to as Red, finds gainful use of his entrepreneurial spirit within the drab walls of Shawshank by dealing in contraband and commodities rare to the confines of prison.  Andy's demeanor and undeniable sense of hope causes Red to take a deeper look at himself, and the world around him.  Andy proves to Red and the other inmates that in the conventional walls of Shawshank prison convention will find no home in his lifestyle.By creating the film's firm foundation, the meticulously chiseled screenplay paved the way for this film's success.  Frank Darabont outdoes himself with the phenomenal adaptation of Stephen King's equally noteworthy novella, Rita Hayworth and Shawshank Redemption.  In this novella, King demonstrates that he can break free from the genre he dominates and still create a marvelous piece of modern literature.  Though the film mirrors the novella in many ways, Darabont illustrates a focused objective of improving upon the areas where the novella came up short, resulting in one of the best book to film transitions ever.While maintaining some of the poetic and moving dialogue of the novella, Darabont also proves that a film's score can generate a great deal of emotional response from its audience, as dialogue does.  He employs the cunning Thomas Newman, son of the legendary Hollywood composer, Alfred Newman.  Darabont shows recognition for the film's needs by employing Newman, who makes the gentle piano chords whisper softly to the viewer, as if a part of the scripted dialogue.  Newman lends himself to individualism and tends to drive more towards the unique in the realm of score composition.  His effort in Shawshank did not go unnoticed, as his score received an Oscar nomination in 1995.  While unique and independent, Newman's score never once intrudes on your concentration or distracts from the film.With work from vast array of talented scene designers, costume designers, composers, cinematographers, and various other Hollywood artists, the cast of The Shawshank Redemption had a strong foundation to work with.  The marvelous cast of this film will dazzle you with some of the most convincing performances you will witness in a film.  While both Tim Robbins and Morgan Freeman shine as Andy and Red, respectively, the true spectacle of acting lies within the plethora of amazing supporting actors who easily disappear into their roles.  Most noticeable of these, the veteran film star James Whitmore, who portrays the elderly Brooks Hatlen.  Brooks, a man incarcerated for an unmentioned crime for so long that he finds himself attached to the Shawshank and the daily life he has lead.  Each of these actors show a true dedication to their art, and a focused purpose in their motivations, creating a convincing setting that never once caters to anything unbelievable.With all of the aesthetic touches and attention to cinematic detail, the most beautiful part of the film lies within its thematic material, such as its focus on the human desires for the most abstract concepts, like hope and freedom.  These themes, which concern things the human spirit undoubtedly yearns for, seem so intricately woven into the plot that it easily draws its audience in to its story.  Though full of hardened criminals, your heart will go out to these men as they display the most basic of human emotions, and deliver some of the most quotable lines in a film to date.  Like a great novel, this film manages to succeed at greater things than simply entertaining an audience.  Darabont tells his story most masterfully, illustrating principles and inspiring his audience to think.  He leaves us a poignant film with a powerful message of hope, and redemption, something we all seek.This film manages to redeem Hollywood in the eyes of people who feared it long lost in a dark sea of clichés and predictability.  Darabont shows us that artists still work in the Hollywood studios and production facilities. These artists show their capability to produce art; real art that inspires you to look at the deeper aspects of life and the world around you.  The Shawshank Redemption delivers much-needed breath of fresh air for anyone who realizes the capability of film.  It proves that masters of the craft still live on this earth, and still bless us with timeless masterpieces that we will never forget.",
            "It is no wonder that the film has such a high rating, it is quite literally breathtaking. What can I say that hasn't said before? Not much, it's the story, the acting, the premise, but most of all, this movie is about how it makes you feel. Sometimes you watch a film, and can't remember it days later, this film loves with you, once you've seen it, you don't forget.The ultimate story of friendship, of hope, and of life, and overcoming adversity.I understand why so many class this as the best film of all time, it isn't mine, but I get it. If you haven't seen it, or haven't seen it for some time, you need to watch it, it's amazing. 10\/10.",
            "One of the finest films made in recent years. It's a poignant story about hope. Hope gets me. That's what makes a film like this more than a movie. It tells a lesson about life. Those are the films people talk about 50 or even 100 years from you. It's also a story for freedom. Freedom from isolation, from rule, from bigotry and hate. Freeman and Robbins are majestic in their performances. Each learns from the other. Their relationship is strong and you feel that from the first moment they make contact with one another. There is also a wonderful performance from legend James Whitmore as Brooks.He shines when it is his time to go back into the world, only to find that the world grew up so fast he never even got a chance to blink. Stephen King's story is brought to the screen with great elegance and excitement. It is an extraordinary motion that people \"will\" be talking about in 50 or 100 years."
        ]
    },
    {
        "title":"The Godfather",
        "url":"https:\/\/www.imdb.com\/title\/tt0068646\/",
        "rating":"9.2\/10",
        "plot":"The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
        "director":"Francis Ford Coppola",
        "cast":[
            "Marlon Brando",
            "Al Pacino",
            "James Caan",
            "Richard S. Castellano",
            "Robert Duvall"
        ],
        "release_year":"1972",
        "duration":"2h 55m(175 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNGEwYjgwOGQtYjg5ZS00Njc1LTk2ZGEtM2QwZWQ2NjdhZTE5XkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
        "comments":[
            "I love this movie and all of the GF movies. I see something new every time I have seen it (countless, truly). The story of tragedy and (little) comedy that exists in this film is easily understood by people all over the world. This film has been called an American story however I have met others who have seen this movie in other languages and they seem to have the same love and appreciation for it that I do. I love the characters and all of the different personalities that they represent not just in families but in society itself. It seems like the entire cast is part of every other movie that I love as well. The sounds, music, color and light in the film are just as much a part of the film as the people. This could be attributed to the method in which it was filmed. At many parts of the film I can still find myself feeling the emotions conveyed in the film. I never tire of appreciating this film. I thank God that FFC is an American treasure. We are fortunate to have him.",
            "There is very little that I can add to the reviews on here, that have explained what is so wonderful about The Godfather so well. I have seen many amazing movies, as well as some clunkers, but The Godfather was beyond amazing. There are so many images, details and scenes that I seriously cannot get out of my head since watching it for the first time just nine hours ago. The Godfather is so incredibly well-made and acted that it stands out among the rest of those other amazing films I've seen, so much so I couldn't think of a single flaw, and I am struggling to think of a good enough reason to why I didn't see this film before now.True, The Godfather is a little slow-moving and the plot takes a while to unfold, but neither of these are flaws as such. The slow pacing added to the elegiac quality The Godfather has, and as for the plot what is special about this plot is that it is very unpredictable because you have next to no idea where it is next going to take you. Being 18, I was worried whether I was old enough to appreciate this film or even understand it, but luckily I understood it perfectly, and I can well and truly appreciate it for the masterpiece it is considered to be.The Godfather for one thing looks stunning. I strongly disagree with the previous reviewer who said the cinematography was horrid, for me the cinematography was one of the best assets of the film. In some scenes you have cinematography and lighting that is quite dark and mysterious, and then in scenes such as the wedding it is evergreen, autumnal and very picturesque. It is not just the cinematography that makes The Godfather look stunning, the costumes are beautifully tailored, the houses are gorgeous and majestic to look at and even the cars were immaculate.Then there is the score by Nina Rota. One word, outstanding! I have heard many wonderful scores in my lifetime, but after hearing this score few stick in the memory as much as the score for The Godfather. This score is both beautiful as seen with the main theme, and haunting in the way it sticks in your head after watching the film itself. Other outstanding assets are the masterly direction from Francis Ford Coppola, and the brilliantly written screenplay that is intelligent, thought-provoking and darkly humorous. As for the violence, some of it is shocking and intense especially in the climax which was enough to almost make your heart either beat twice as fast or stop, and I almost covered my eyes when the producer found the horse's head in his bed, but underneath that this family is somewhat loyal and honourable come to think of it.The acting is absolutely fantastic, bringing to life characters that are rich and complex, perhaps unlikeable at first but as you get to know them you warm to them. And I have to say, The Godfather is one of those rarities where no actor gives a weak performance. In particular, Marlon Brando is brilliant as Don Vito, very heavily disguised yet stately. Every word of dialogue, every subtle hand gesture and every facial expression was brilliantly judged. Al Pacino's casting was admittedly risky, but he still did a truly wonderful job carrying the film, while James Caan is dignified and loyal, Diane Keaton beautiful and alluring and Robert Duvall nicely understated.In conclusion, absolutely amazing, and I can see completely why it is considered one of the 10 greatest movies ever made, it is that good. In fact my 15-year old brother loved it so much, he wants to see it again. 10\/10, though this film is too good for that rating. Bethany Cox",
            "One of the best films of all time, an absolute masterpiece. The Godfather is arguably the best gangster drama as well as setting the standard for cinema."
        ]
    },
    {
        "title":"The Dark Knight",
        "url":"https:\/\/www.imdb.com\/title\/tt0468569\/",
        "rating":"9.1\/10",
        "plot":"When a menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman, James Gordon and Harvey Dent must work together to put an end to the madness.",
        "director":"Christopher Nolan",
        "cast":[
            "Christian Bale",
            "Heath Ledger",
            "Aaron Eckhart",
            "Michael Caine",
            "Maggie Gyllenhaal"
        ],
        "release_year":"2008",
        "duration":"2h 32m(152 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
        "comments":[
            "Im just gonna start off by saying I LOVE this movie.Its one of my favorites of all time. I honestly cant think of too much wrong with this movie other than its a little long and Batmans by now infamous voice. But everything else is top notch. The acting,story,atmosphere,and actions scenes are all amazing. If you haven't seen this movie see it right now! I went into this not expecting to much but I came out blown away, I cant imagine any movie being much better. I'll just have to wait for The Dark Knight Rises to release to see if anything can be better. Until then, this stands as the best movie I've ever seen",
            "This movie is a work of art. The finest sequel ever made. I don't think we will see another movie like this for a long time. Heath Ledger's Joker is the best movie charachter I have ever seen by far. Avengers Endgame is great, but The Dark Knight is much better. The best Batman ever! The best Joker ever! The best DC movie ever! The best superhero movie ever! Ando for me, the best movie ever!",
            "*level of enjoyment*\n#10\ntop tier - from start to finish The Dark Knight has you on the edge of your seat, enjoying every minute*likelihood to recommend*\n#10\nhighest recommendation - if you haven't seen it, watch it, it is a masterpiece, the downside? likely to put all future Batman features to shame*quality of acting*\n#9\nexcellent - Bale is the gold standard Batman, gruff, tough, aloof, positively fueled by the tragedies of his dark past. Ledger is the nightmare villain, twisted, evil, unapologetic, irrational, completely void of a moral compass*quality of writing*\n#10\nperfection - one of those movies you wish you could have a memory edit in order to watch again and again*quality of intangibles*\n#8\nexcellent - visual is on point, dark gloomy Gotham, perfect setting for a hero to operate and succeed from the shadows\nvery good - music and sound puts viewers in the mood and anticipating the next intense scene"
        ]
    },
    {
        "title":"The Godfather Part II",
        "url":"https:\/\/www.imdb.com\/title\/tt0071562\/",
        "rating":"9.0\/10",
        "plot":"The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
        "director":"Francis Ford Coppola",
        "cast":[
            "Al Pacino",
            "Robert De Niro",
            "Robert Duvall",
            "Diane Keaton",
            "John Cazale"
        ],
        "release_year":"1974",
        "duration":"3h 22m(202 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMDIxMzBlZDktZjMxNy00ZGI4LTgxNDEtYWRlNzRjMjJmOGQ1XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
        "comments":[
            "To say that this film is a sequel is a sin.\nAl Pacino and Robert de Niro win the Oscar for this film, Robert de Niro's performance as Vito Corleone is perfect, every scene in which this one is perfect. Al Pacino as always perfect and unlike the first film, he is much better.PROS:EVERYTHING. The script, the direction, the cast, the performance, everything in this film is perfect and its 3 hours are worth it.CONS:NOTHING. This movie is perfect.",
            "The Godfather Part 2 is the finest sequel ever made and is arguably a finer film than the original Godfather. The film is divided into two main parts - the story of a young Vito Corleone (flawlessly acted by Robert De Niro and a worthy Oscar winner) and the rise to power of Michael as the head of the family. Francis Coppola recollaborated with many of the crew members of the first film and again achieves a quite superb period piece thanks to the cinematography of Gordon Willis and set design of Dean Tavoularis. The acting performances are outstanding, hence three supporting oscar nominations for acting guru Lee Strasberg (Hyman Roth), Michael Gazzo (Frank Pentangeli) and Robert De Niro (young Vito Corleone). Duvall, Keaton, Cazale and Shire all provided first rate performances but it is the performance of Al Pacino which steals the show, expertly portraying Michael as a cool, calculating, suspicious Don Corleone. The film expands upon the original movie and brings us into the family's activities in Nevada, Florida and Havana. Arguably the finest movie of the 70s, a cinematic masterpiece with the greatest ensemble acting you will probably see.",
            "The original Godfather is a brilliant work. It is in a sense a voyeuristic delight, allowing us to see the mafia from the inside - we become part of the family. It single-handedly change the world's view of organized crime, and created a cast of sympathetic characters, none of whom have a shred of common morality. It was the highest grossing movie of its time and Brando created a cultural icon whose influence resonates as strong today as it did in 1972.As extraordinary an achievement as this is, Part II is even better. It easily receives my nod as the best picture ever made. I have seen it at least 20 times, and each time its 200 minutes fly by.The movie uses flashbacks to brilliantly weave two tales. The main story is the reign of Michael Corleone as the world's most powerful criminal. Now reaping the benefits of legalized gambling in Las Vegas, Michael is an evident billionaire with an iron fist on a world of treachery.Behind this, Director Francis Ford Coppola spins the tale of the rise of Michael's father, Vito, to the center of the New York mafia. It is these scenes that make the film a work of art. Without spoiling, I will simply say the Robert DeNiro as the young Vito is the best acting performance of all time, a role  for which he won a richly deserved Oscar.The screenplay is full of delicious little underworld nuggets (\"Keep your friends close .....\", \"I don't want to kill everyone, just my enemies\"), while it blows a dense, twisted plot past you at a dizzying and merciless pace. The cinematography is depressing and atmospheric. The score continues in the eerie role of its predecessor, foretelling death and evil.All of this makes the movie great and infinitely watchable. But it's what's deeper inside this film ... what it is really about ... that is its true genius.The Godfather Part II is not really a movie about the mafia, it is a movie about a man's life long struggle. Michael controls a vast empire that is constantly slipping out of his hands. He grows increasingly distrustful and paranoid, and even shows signs that he hates his own life. Michael almost seems to resent the fact that he is a natural born crime lord, a man who puts the family business ahead of everything.The great Don Michael Corleone can never come to terms with one simple fact.... his father's empire was built on love and respect, Michael's empire is built on fear and violent treachery.See this movie. It's three-and-a-half hours very well spent."
        ]
    },
    {
        "title":"12 Angry Men",
        "url":"https:\/\/www.imdb.com\/title\/tt0050083\/",
        "rating":"9.0\/10",
        "plot":"The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.",
        "director":"Sidney Lumet",
        "cast":[
            "Henry Fonda",
            "Lee J. Cobb",
            "Martin Balsam",
            "John Fiedler",
            "E.G. Marshall"
        ],
        "release_year":"1957",
        "duration":"1h 36m(96 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYjE4NzdmOTYtYjc5Yi00YzBiLWEzNDEtNTgxZGQ2MWVkN2NiXkEyXkFqcGc@._V1_QL75_UX190_CR0,6,190,281_.jpg",
        "comments":[
            "In my opinion, the best movie ever made. Brilliant performances all around. A whole lot of dialogue, but you never get tired of listening. Lumet's first film-what an amazing talent. Henry Fonda and Lee J Cobb stand out, but all are excellent. There was a prior TV version, which is horrible. Lumet's version is the only one to see.",
            "There are a few wonderful courtroom dramas out there, Anatomy of a Murder, To Kill a Mockingbird and Witness for the Prosecution immediately springing to mind. 12 Angry Men is so brilliant, it could very well be the definitive courtroom drama on film. Sidney Lumet's direction is masterly, and although the action takes place on one set(an actual New York drawing room) there are a huge variety of innovative camera angles and visual set-ups. The screenplay is sophisticated and smart, and the story is compelling and intelligent. The film is also brilliantly made, and the acting is superb. Henry Fonda especially dominates the film, with an integrity that makes his character so wonderful, but the other actors are wonderful as well, Ed Begley, Jack Warden, John Fiedler, Lee J Cobb, Rudy Bond et al. are all impeccable support to Fonda. Overall, brilliant courtroom drama. 10\/10 Bethany Cox",
            "This is one of those movies where everything could go wrong. The story is as simple as it can be: 12 men are jurors on a open and shut murder trial, but one man thinks that another persons life deserves at least some thought on the matter and votes not guilty. From this point on we have 12 actors and a closed room. This could be the most boring film ever made. Lumet however is a master of mise-en-scene and provides a tense movie that keeps you locked on from the word \"go\". The dialogs are great and supported by incredibly talented actors. Joel Schumacher in Phone Booth needed to see this movie and draw a few ideas on how to make a character built, dialog driven movie. A must see for everyone."
        ]
    },
    {
        "title":"The Lord of the Rings: The Return of the King",
        "url":"https:\/\/www.imdb.com\/title\/tt0167260\/",
        "rating":"9.0\/10",
        "plot":"Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
        "director":"Peter Jackson",
        "cast":[
            "Elijah Wood",
            "Viggo Mortensen",
            "Ian McKellen",
            "Noel Appleby",
            "Ali Astin"
        ],
        "release_year":"2003",
        "duration":"3h 21m(201 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTZkMjBjNWMtZGI5OC00MGU0LTk4ZTItODg2NWM3NTVmNWQ4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
        "comments":[
            "All the threads of Tolkien's magnum opus come together in the most elegant of fashions in the final part of Peter Jackson's adaptation. Humanity makes a last stand at Minas Tirith, the Hobbits travel through Mordor, our heroes try to by time for Frodo to complete his mission and the Evil Sauron gets tired of the whole game and lashes out with all his might and fury.\"Return of the King\" is 4 hours of payoff, a third act in a gigantic epic rather than a mere film of its own. As such it is intensely dramatic and dynamic and you can very much sense that though peter Jackson spared no effort on the previous episodes, this is clearly his favorite. the film floats by at a thunderous pace, taking us through unforgettable moments such as the battle of Minas Tirith itself, a marvel of seamless animation and epic film-making, it demands to be seen, as it has too many jaw-dropping moments to choose from. The quieter character moments keep gaining in potency and the full weight of the stakes and their heartbreaking consequences is never in doubt.The cast of these films have played their parts to perfection and again Jackson deserves overall credit for choosing actors that so perfectly match Tlolkien's creations: Ian McKellen and Christopher Lee are their own usually excellent selves, and the hobbits remain endearing, but of all the uniformly great cast, the true standouts are Viggo Mortensen and David Wenham as the tragic Faramir, whose relationship with his brutish father is the most traumatic of the film. Jackson pushes them even further by having them sing at a few key moments (a practice employed to powerful effect by Tolkien in the books), a daring undertaking that works wonders. And though he may offer one ending too many, he does have the decency to show off each surviving character with the appropriate screen time and respect.Now that the trilogy is complete, it can be viewed as one big film, as it should be. After 8 years, Jackson has done the impossible: he has taken Tolkien's huge legend and made films that stand on their own and have revolutionized film-making, setting the new benchmark for cinematic epics. Changes have been made to Tolkien's source novels, but they make for better, more fluid films, more faithful in spirit to Tolkien's myth than anyone had the right to hope for.A masterpiece, whether as part of a bigger whole or on its own. Well deserving of all the high praise thrown at it, and then some...",
            "Feeling weary and battle-worn, I have just staggered out of the cinema after three and a half hours of special effects creatures fighting other special effects creatures. I had taken refreshments but barely touched them - probably because the film I had watched is one of the most mesmerising, evocative, inspiring, and awesome I have witnessed of any big adventure epic. Not to mention superb ensemble acting, moods that shift effortlessly between mediaeval battles of colossal proportions and convincing bloodshed, beauty and wonderment, fantastic natural and artificial landscapes and cityscapes, touches of humour, well-paced dramatic tension, and human bonding that is moving enough to just let you dry your eyes as the unassuming credits flash by.Return of the King is the greatest of the Tolkien trilogy by New Zealand director Peter Jackson. Although I've seen the other two and read the book, I felt it would also stand alone well enough for people who hadn't done either.The storytelling is much more professional that the first one - which maybe laboured to introduce so much information - or the second one - which has little let up from the tension of long battle scenes. In Return of the King, there is an emotional sting at the start, as we watch the transformation of Gollum from warm, fun-loving guy to murderous, mutated wretch. The movie then moves deftly between different segments of the story - the sadness of the lovely soft-focus Liv Tyler as fated Arwen whose travails and woman's love succeeds in having the Sword that was Broken mended, the comradeship of Sam and Frodo (Sean Astin & Elijah Wood) that is tested to the limits, the strong commanding presence of Gandalf (Ian McKellen) who keeps an eye on things whilst turning in an Oscar-worthy performance, the ingenious and very varied battle scenes, and the mythical cities of that rise out of the screen and provide key plot elements.This is a fairy story of human endeavour, the defeating of power cliques and the triumph of the human spirit that could almost be compared to Wagner's Gotterdammerung. It is a fairy story without any sugary sweetness, a fairy story the likes of which hasn't been told so well before, and is even unlikely to be done so well in the future. The haunting scream of the Nasgul stays with you, the physical attractions are not airbrushed, and the battles are about as far from pantomime characters waving wooden swords as you can get. The ingenious monsters keep you on the edge of your seat. The whole narrative maintains the spirit (if not archival, detailed accuracy) of the original and makes you want to read the book (or read the book again!)The worst I can say about it is that it is maybe a tad long - but not that you'd notice . . .",
            "Saying that this film starts where `Two Towers' left off is somewhat misleading, for the film starts a great distance from the walls of Helm's Deep. `Return of the King' opens with a flashback of Smeagol (Andy Serkis) obtaining the one ring of power and an origin of his deterioration into the creature Gollum. This opening recaptures an emphasis that was somewhat lost within the epic battles of `Two Towers,' at that's the ring. The first installment, `The Fellowship of the Ring,' provided heaps of exposition on the ring's importance and influence, and in `Return of the King,' we see it pay off, big time.After the armies of Isengard have been defeated due to an allegiance between Theoden (Bernard Hill), the king of Rohan, and the elves, the main threat to middle earth is now concentrated in the kingdom of Mordor, controlled by the dark lord Sauron. Sauron has turned his eye towards the realm of Gondor, the last free kingdom of men, and the wizard Gandalf (Ian McKellan) must warn Denethor (John Noble), Steward of Gondor of the impending attack, while Aragorn (Viggo Mortenson), heir to the throne of Gondor, and Theoden gather men to aid against the armies of Mordor. The dark lord Sauron needs only to regain the one ring of power to conquer all of middle earth, and two hobbits, Frodo (Elijah Wood) the ring-bearer and Sam (Sean Astin), must continue their journey, directed by Gollum, to Mount Doom, the only place where the ring can be destroyed. Got all that? If not, you need to bone up on your `Lord of the Rings' before expecting to follow this film.Since all three epics were filmed simultaneously, each individually has the feel of being part of a larger picture - except for this one. `The Return of the King' is just too big, the most epic of a set of epic films. Now that director Peter Jackson has brilliantly constructed the characters and plotlines throughout the first two films, he puts them to use.All of the characters have their best moments within this film. The pair of mischievous hobbits, Merry (Dominic Monaghan) and Pippin (Billy Boyd), are no longer the tree ornaments they were from `Two Towers,' but are split-up, and take their characters in completely new directions. Aragorn, played with an unmatched sense of honor by Viggo Mortenson, is about to meet his destiny as the future king of all men, while Andy Serkis continues his expert portrayal of Gollum (Serkis' provided not only the voice of Gollum, but also assisted during production by acting out the scenes of the computer-generated character with his fellow actors).However, the real acting triumph of the film is Elijah Wood as Frodo Baggins. He continues his descent into corruption with an incredible talent that many could not pull off. Wood's performance is so critical to the film because it determines the ring's power to corrupt, which, needless to say, is absolute.The first two films established Jackson as an incredible visionary, shooting vast landscapes from his native New Zealand. With `Return of the King,' Jackson really gets a chance to show off. With, hands down, the most beautiful visuals of the trilogy, Jackson makes `Return of the King' a gorgeous feast for the eyes, while never resorting to McG level over-the-topness. Jackson stays very grounded in his characters, not letting the effects tell the story, but only assist the wonderful dialogue and characters. Think of `Return' as a mix of `Fellowship' and `Two Towers,' with enough action and character development worthy of ending a film event of this magnitude.The bottom line, fans of the films will not be disappointed. Hardcore Tolkien lovers might be upset by plot changes and interpretations made by Jackson and the other writers, however, it is unrealistic to expect a completely true adaptation of the novels, being that film is an entirely different medium. Despite the alterations, Jackson consistently stays true to the major themes and ideas from the original text, while adding some of the finest filmmaking ever put to screen. `The Lord of the Rings: The Return of the King' is one of the most finely tuned and cinematically perfect films ever made. Not only the best of the trilogy, but a crowning achievement in epic filmmaking."
        ]
    },
    {
        "title":"Schindler's List",
        "url":"https:\/\/www.imdb.com\/title\/tt0108052\/",
        "rating":"9.0\/10",
        "plot":"In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "director":"Steven Spielberg",
        "cast":[
            "Liam Neeson",
            "Ralph Fiennes",
            "Ben Kingsley",
            "Caroline Goodall",
            "Jonathan Sagall"
        ],
        "release_year":"1993",
        "duration":"3h 15m(195 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNjM1ZDQxYWUtMzQyZS00MTE1LWJmZGYtNGUyNTdlYjM3ZmVmXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
        "comments":[
            "This Movie was sensational. It was a piece of art along with being informational. It told people about the holocaust, and it also told people about the human spirit. It shows how people can just triumph over anything with just some help from one person The things that Spielberg did with the movie was incredible too. The black and white was genius, and how he had the little girl in red and the fire was phenuminal. I have never seen anything like it, Schindler's List is beyond all words.",
            "The movie started out pretty innocently, and for the first 20 minutes, I was wondering where the movie was going. Then it started to happen. The horrible cruelty of concentration camps. Oskar Schindler is an example of a man that no matter what the situation, there are people who won't go along with the cruelty of society. I'm sure it took courage to do what he did, because one wrong move and you'll be dead.Movie brought to life this great man who really shouldn't be forgotten, and thanks to Steven Spielberg, I think he'll be remembered for generations to come. Movie like this should be made once in a while. Not that movie should be used for evangelistic purposes but some story should be told well, and movie is still the best vehicle to do so.I still think that Oskar Shindler's last words in this movie was one of the best dialog in movie history - \"Why did I keep this badge ? I could have saved a person. Why did I keep this car ?, I could have saved five more people.\"",
            "Schindler's List is undoubtedly the best Holocaust film ever made. There just isn't anything like this film. Various other films have tried to show the true horrors of the Holocaust, but none of them succeeded the way that Schindler's List did. Schindler's List is a difficult film to watch. When you see the true atrocities of the Holocaust, your jaw drops. When you see the pain that all of the innocent people were going through, the only thing you can do is cry. The true goal of all Holocaust films is to make you feel sorrowful, and Schindler's List did that to me. If you want to see the best depiction of the Holocaust, make your way towards Schindler's List.\nMe n my kids cried during the pit scene."
        ]
    },
    {
        "title":"The Lord of the Rings: The Fellowship of the Ring",
        "url":"https:\/\/www.imdb.com\/title\/tt0120737\/",
        "rating":"8.9\/10",
        "plot":"A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
        "director":"Peter Jackson",
        "cast":[
            "Elijah Wood",
            "Ian McKellen",
            "Orlando Bloom",
            "Alan Howard",
            "Noel Appleby"
        ],
        "release_year":"2001",
        "duration":"2h 58m(178 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNzIxMDQ2YTctNDY4MC00ZTRhLTk4ODQtMTVlOWY4NTdiYmMwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
        "comments":[
            "Breathtaking.  Unique.  Captivating.  Enchanting.Within minutes of the start of this first chapter of an undeniably epic trilogy, the audience was left gasping at the intensity of the images on the screen.  And we had nearly three hours to go.The scope of Tolkien's masterpiece may have eluded film-makers for decades, but director Peter Jackson makes good on his promise: he has not only brought us the tale of Frodo and his bold companions, he has brought us Middle Earth.  And believe me, it is BIG.  Sweeping vistas and hang-onto-your-seat camera shots send us zooming through the towering cities and citadels of Tolkien's imagination.But even more impressive than the stunning visuals and sound-effects-like-you've-never-heard-before are the actors who breathe life into the characters.  Ian McKellen's portrayal of Gandalf is nothing short of awe-inspiring, and Elijah Wood's Frodo is one of the most unexpectedly captivating performances I've seen in a long time.  The despair, terror, and determination of the Fellowship is all there, in spades.  I left the theater aching...from tensing every muscle during the fight and flight sequences--the breathless and compelling kind we haven't seen since Spielberg gave us a desperate charge onto the D-Day beaches of Normandy.Those unfamiliar with Tolkien's world may quickly find themselves lost in it, but happily so.  The depth of his creation cannot be grasped in a few hours, and it doesn't need to be; the struggle of good against evil explodes on the screen, and leaves little room for complaint.The movie ended with a stunned audience sitting on the edges of their seats, feeling somewhat bereft.  We were exhausted, but no one wanted to wait a year for more.Jackson's ambitious first chapter is truly unlike anything you've seen this year.  George Lucas and Chris Columbus take note: this is how you deliver on a cinematic promise.For everyone else: don't you dare miss it.",
            "It is my firm belief that the standard versions of The Lord of the Rings should be jettisoned in favour of the extended editions universally. Sure, the near 4 hour runtime is a tad steep, but for an absolute masterpiece like this, it's work every second and the first act of undoubtedly the best trilogy in cinematic history!",
            "It is with no surprise that Peter Jackson's The Fellowship of the Ring film has received such mixed critics. Many viewers refer to it as being childish, boring and uninteresting. Seems to me that it is bound to the same fate of Tolkien's books, destined to be a target for the same type of misunderstandings that keep attacking this literary masterpiece many decades after it's first publication.Having read the books several years ago, I went to see this `impossible' film when it came out with many doubts on my mind. I really liked it, but left the theater with as many doubts as I had before. Was it perfect? Well, maybe not, but what an achievement. After watching it a few times on DVD, and thinking about it for some time now, I find myself loving this film more and more. Let me tell you why...The Lord of the Rings is a fairy-tale of myth and fantasy. Peter Jackson directed a film that was considered, for a very long time, impossible to make, and not only for technical reasons. The narrative roots are incredibly long and detailed, and the storyline is deeply connected with the creation of a fantastic continent from a time unknown called `Middle Earth'. It's author, Tolkien, dedicated a considerable part of his life developing this continent's background, it's mythology and origins, it's different kinds of people, cultures and languages, and therefore it's geographic references are determinant to the unfolding of the story of the One Ring.Peter Jackson went out to achieve the impossible and came out with a recreation of the original that is pure and true to the story in every detail. The first time the four hobbits meet a black rider on the road, for example, is absolutely faithful to the feeling of the book. The assault of the riders at Weathertop is another great example, and it captures that feeling of danger, density and atmosphere that are the main characteristics of the tale. Jackson also took some liberties with the story, and made some right choices along the way. If the so called `purists' may not approve the removal of Tom Bombadil altogether, it should be comprehensible that the travel from Hobbiton to Rivendel is a very long and detailed one and could easily make a movie on it's own. I felt more uneasy with how short the Council of Elrond was. In the book, the council is where the whole story of the rings is first explained, and many passages from the past ages of Middle Earth are unveiled. It is a fascinating moment of the story, that had to be shortened for obvious reasons. Still, after some consideration, I now agree with the options made by Peter Jackson, and think that the movie prologue narrated by Galadriel was the wisest choice. The magic is all there when Gandalf shuts his eyes the moment Frodo stands in the council and says `I will take the ring'. It is there at Moria's Gate, and at the fall of Boromir. It is a powerful film that doesn't fit the rhythm of the standard Hollywood action movie. It is a film that breeds, that takes time to unfold, it's tale branching in every direction.I could go on and on, talking about all the different elements that bring this film close to perfection, but I'll end saying that deep down, this is not about action, beards and big monsters. The greatest thing about this film, to me, is that it brought me back to a time when I was in love with a different world where everything was possible. Reading The Lord of the Rings night after night, I came to understand what this thing of `mankind' really was all about. The corruption of absolute power, the importance and value of friendship, the inevitability of growing up, the strength of hope... That this film could capture that magic, and be a new bearer to it's message of humanism, is a statement to it's greatness. Gandalf's words, that even the smallest person may change the course of the world, and have a part to play in the destiny of all, are immortal.In the end, this is a wonderful film, but that doesn't mean you are going to like it. I cannot tell you what it is like to see this film if you don't know or love the book. But I hope it may plant a seed on your heart to discover a great world of fantasy, beauty and humanity. I believe Tolkien would have liked that."
        ]
    },
    {
        "title":"Pulp Fiction",
        "url":"https:\/\/www.imdb.com\/title\/tt0110912\/",
        "rating":"8.8\/10",
        "plot":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
        "director":"Quentin Tarantino",
        "cast":[
            "John Travolta",
            "Uma Thurman",
            "Samuel L. Jackson",
            "Tim Roth",
            "Amanda Plummer"
        ],
        "release_year":"1994",
        "duration":"2h 34m(154 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYTViYTE3ZGQtNDBlMC00ZTAyLTkyODMtZGRiZDg0MjA2YThkXkEyXkFqcGc@._V1_QL75_UY281_CR2,0,190,281_.jpg",
        "comments":[
            "I like the bit with the cheeseburger. It makes me want to go and get a cheeseburger",
            "Tarantino is without a doubt one of the best directors of all time and maybe the best of the 90's. His first film, Reservoir Dogs was amazing and claustrophobic, his segment in Four Rooms was by far the greatest (even though Rodriguez's was excellent too)and Jackie Brown is a wonderful homage to the Blaxploitation films of the 70's. However, Pulp Fiction remains my favourite.It was nominated for so many Oscars that I still find it hard to believe that it only got one: Best original script. I'm not complaining because Forrest Gump got best picture, since that film was also Oscar-worthy, but come on, movies like Tarantino's or the Shawshank Redemption deserved much more.Anyway, going back to the movie, I particularly liked the first and second chapters, and that's really a contradiction because one of the movie's finest characters, Mr. Wolf, appears on the third. Bruce Willis also does a great job, and as far as I'm concerned he fell in love with the movie right after having read the script. I like the way his character gives a \"tough guy\" image at the beginning and then we discover he's so affectionate and tender to his wife. Travolta is obviously the star of the movie and his second encounter with Bruce Willis in the kitchen along with the scene where he dances with Uma Thurman is when the movie reaches it's highest point.The other star is Samuel L. Jackson, who plays a wise assassin that obviously knows how to handle situations. \"And I will strike down upon thee with great vengeance and furious anger...\" is my favourite quote.Summarizing, Pulp Fiction is a modern classic and a must-see for anyone who is at least aware of what a movie is. I give it a 9 out of 10.",
            "Before I saw this I assumed it was probably overrated. I was wrong. It lives up to and surpasses its reputation in pretty much every way. I would definitely recommend."
        ]
    },
    {
        "title":"The Good, the Bad and the Ugly",
        "url":"https:\/\/www.imdb.com\/title\/tt0060196\/",
        "rating":"8.8\/10",
        "plot":"A bounty-hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
        "director":"Sergio Leone",
        "cast":[
            "Clint Eastwood",
            "Eli Wallach",
            "Lee Van Cleef",
            "Aldo Giuffrè",
            "Luigi Pistilli"
        ],
        "release_year":"1966",
        "duration":"2h 58m(178 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMWM5ZjQxM2YtNDlmYi00ZDNhLWI4MWUtN2VkYjBlMTY1ZTkwXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
        "comments":[
            "The Good, the Bad and the Ugly or the Good, the Better and the Best, as I prefer calling it, is a bizarrely sublime and a uniquely aesthetic masterpiece. The actors in title roles have given such extraordinarily superb performances, that it would be impertinent and disparaging to merely regard their swell work as acting. In fact their brilliant portrayals have immortalized Blondie, Sentenza\/ Angel Eyes and the enigmatic Tuco. Lee Van Cleef is fiendishly unforgiving as the merciless Angel Eyes. Clint Eastwood is rugged yet suave, cocky yet adorable as laconic cigar-smoker Blondie, a role that laid the foundations of his illustrious career. But it is Eli Wallach, who steals the show with his captivating portrayal of Tuco, a portrayal that is as entrancing as it is enlightening. Wallach is amusing, capricious, nonchalant, uncanny and yet tenacious as Tuco, perturbed by his insecurities and dampened by his solitude. It is the tacit amicability between Blondie and Tuco and their mutual hostility towards the evil Angel Eyes owing to the vestiges of virtue present in them, redolent of their moribund morality, which gives the story, the impetus and the characters, a screen presence that is not only awe inspiring but also unparalleled.Sergio Leone's magnificent and ingenious direction in synergy with Ennio Morricone's surreal music, Tonino Delli Colli's breathtaking cinematography and Joe D'Augustine's punctilious editing makes the movie, a treat to watch and ineffably unforgettable. Initially aimed to be a tongue-in-cheek satire on run-of-the-mill westerns, The Good, the Bad and the Ugly, continues to stand the test of time in its endeavor to attain apotheosis (if it hasn't attained it yet). It will always be remembered as European cinema's greatest lagniappe, not only to the Western genre, but to the world of cinema.It's a must watch for any movie lover. 10\/10",
            "I wasn't sure if I was going to comment on this film because everything has already been said by the hundreds of other people who have posted their thoughts, but I decided that I should really put my two cents in since this is my favorite movie.This film, in my opinion, is not only the greatest spaghetti western of all time. It is the greatest movie of all time. Period. Regardless of genre. I could probably watch it every day, and be perfectly happy doing so.The music is perfection. The way the music drives this movie is absolutely amazing. The musical genius of Morricone and the incredible direction of Sergio Leone is a combination that will probably never be equaled. The theme song will forever be etched in your brain. In fact, it probably already is, even if you haven't seen the movie! The scene where Tuco runs through the graveyard with the song \"Ecstacy of Gold\" is pure poetry. And the showdown at the end with that great music- just incredible.The story is riveting. There is not a single dull moment. The movie is long, but Leone's direction is so good that you will love the fact that you can enjoy this movie for three hours.Lee Van Cleef is my favorite spaghetti western actor, and he is incredible as \"Angel Eyes.\" It is the part he was born to play. Eli Wallach is perfect as Tuco. He really shines in this movie. Some people say he steals the show, and I can see why they think so. Eastwood is excellent as \"Blondie,\" although I don't think Eastwood has as strong of a presence as Van Cleef (I know many will disagree, and that's OK because all three actors are superb in this film so why split hairs?).This movie is hypnotic. It's operatic. It's sad. It's funny. It's gritty. It's violent. It's art. It's action. It's pure entertainment. The film is just so incredible on so many different levels that EVERYONE should see it, regardless of what kinds of movies they are into. And it's so cool that the greatest flick ever just happens to be a spaghetti western. If you haven't seen this movie, stop what you are doing, and go get it now!!",
            "After many years of barely watching any movies, I treated myself to several classics recently. And this was the best.That I so enjoyed this movie so much came as a shock to me. I literally never before have been able to even sit through a western, which (in my admittedly limited experience) was schlock action starring John Wayne as the taciturn all-American good guy being tough and beating up the outlaws. Watching GBU, I was enthralled for the entire three hours. Twice. And if I had time, I would have watched it a third time.The setting is typically western: a dry, dusty panorama in which men barely co-exist with each other; few wasted words; and lots of action, horses, and gunfighting in a wild west barely governed by incipient institutions of law & order \u0096 all shrouded within a morality play of good vs. bad. But what I liked so much is exactly what I hate about John Wayne westerns \u0096 the seriousness and honesty with which moral context is considered. In Hollywood, good vs. bad is as thoughtlessly superscripted as the protagonists' white and black hats. In GBU every remnant of moralizing has been ruthlessly cut.Good, Bad, and Ugly are personified in the form of three characters: Bad (\"Sentenza\") is the easiest to understand. He is *very* bad, perhaps not so different from other villains, but much more sharply developed; murderous, sadistic, traitorous, and remorseless. Good (\"Blondie\") and Ugly (\"Tuco\") are more puzzling, but their labels are the key to the movie. Both Blondie and Tuco are outlaws and killers with only the barest hint of morality, but they're not evil in the same way that Sentenza is. Tuco is demonstrative, emotional, loud, wild, and unpredictable; but driven by survival rather than satanic urges. Blondie is cool, calm, rational and controlled \u0096 in many ways similar to Sentenza \u0096 but whereas Sentenza tortures, maims, kills, and lies for the hell of it, even apparently enjoys it, Blondie simply goes about his business coolly, and shows several poignant hints of empathy, decency, and a sense of justice.GBU takes place during the Civil War and strips away the high-level political struggle of history books, leaving us with the soldier's vantage point of brutality, pointless death, and some individual decency. The politics are indecipherable from this vantage point. GBU hits this point home when our protagonists wind up in a prison camp because the oncoming gray cavalry uniforms turn out to be dust-covered blue. Later, they encounter an army fighting over a worthless bridge, suffering countless pointless deaths and casualties. Because Leone has so rigorously excised traditional off-the-shelf morality, the few instances of humanity are remarkably poignant. One such instance is when Blondie shares his coat and cigar with a dying soldier; another is when prisoners are forced \u0096 by Sentenza's orders \u0096 to play music to cover up the screams of the tortured. Sentenza apparently enjoyed the irony of beautiful sounds used for such ends; the musicians are, of course, pained by it.That was one of many extraordinarily striking scenes. The honesty of the moral context was what I liked best about the film, but I liked everything else too. Indeed the same primal, ruthless honesty that characterizes the character development pervades the film. The music is unlike anything I'd ever heard \u0096 it's an audible version of the arid west and the tensions and lawlessness that characterize the film. Underlying the entire score is one instantly memorable theme starting off with what sounds like a screaming hyena. The story took place in New Mexico, and even though it was filmed in Spain, it really does look like New Mexico; and just as in life in the American west, the wide, breathtaking panorama tends to subordinates dialog. Indeed, it is several minutes into the film before even one word is spoken.The plot was extremely clever \u0096 and never predictable. High level suspense is maintained for the full three hours. It was hard to imagine how it could unfold \u0096 three uncompromising outlaws in search of one buried treasure; cooperation was not in their nature, but nothing was ever done out of character. Any Western cliché that you can think of is either given a unique twist or destroyed by masterful storytelling. For example there is an utterly irreverent scene in which Tuco meets his brother, a sincere Priest, and turns platitudes upside down. The brother begins with the standard rebuke of the criminal's behavior, but Tuco punches back and says, \"Where we come from there were only two ways out. You lacked the courage to do what I've done.\" The movie is also irreverently funny: For example, Twice Tuco gained the upper hand on Blondie and said:\"There are two kinds of spurs(?), my friend. Those that come in by the door, and (crosses himself) those that come in by the window.\"\"There are two kinds of people in the world, my friend. Those who have a rope around their neck and those who have the job of cutting.\" Later Blondie gained the advantage of Tuco and observed:\"You see in this world there's two kinds of people my friend - those with loaded guns, and those who dig. You dig.\" In addition to all these specific attributes, a unique and strikingly cool style infuses the entire film: long scenes of tense silences \u0096 never for an instant boring; and telling, startling close-ups and transitions. Most noteworthy was the film's climax. As the protagonists stand there with their fingers on their holsters, waiting for the first person to go for their gun(s), the transitions start out slowly, and speed up as the tension increases. As I write this, I wish I had my own copy of the film, just so I could see this scene again.Not just a great western, but easily one of the best movies of *any* kind ever made."
        ]
    },
    {
        "title":"The Lord of the Rings: The Two Towers",
        "url":"https:\/\/www.imdb.com\/title\/tt0167261\/",
        "rating":"8.8\/10",
        "plot":"While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
        "director":"Peter Jackson",
        "cast":[
            "Elijah Wood",
            "Ian McKellen",
            "Viggo Mortensen",
            "Bruce Allpress",
            "Sean Astin"
        ],
        "release_year":"2002",
        "duration":"2h 59m(179 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMGQxMDdiOWUtYjc1Ni00YzM1LWE2NjMtZTg3Y2JkMjEzMTJjXkEyXkFqcGc@._V1_QL75_UX190_CR0,7,190,281_.jpg",
        "comments":[
            "From the beginning to the very end, the Lord of the Rings trilogy is interesting and enjoyable. The books and the movies alike grasp one's attention as if they were real. You, the reader or viewer, can sense the pain of the characters, their emotions. The trilogy is truly powerful on screen. The second movie, however, I believe has something the first and third are missing; it feels like a bridge connecting two great islands. There is something unique about it that cannot easily be described. Metaphorically, the first movie is, say, a soldier. The third movie is the path home from war. And the second movie is the act of coming home because it contains the obstacles that must be passed through before achieving the goal. Although not 100% loyal to the written trilogy, the movies are done in such a way that the mainstream audience and LOTR fans from before the movies came out can say they were enjoyable and well made.",
            "The opening scene of The Two Towers provides an outstanding, yet very brief, taste of action, cinematography, and special effects, only to be matched (and far surpassed) in the final hour of the film. The stunning events of the third hour of The Two Towers are undoubtedly the centerpiece of the film, and while the first two hours serve finely as story development, they primarily build anticipation for the final hour, which mostly depicts the battle of Helm's Deep. More than anything else, the first two hours merely tease and torment the patient audience. It's a shame that such a gap has to exist between the first minute and the final hour, but I take no reservations in saying that despite how you feel about the first two hours of the film, the final hour will make the wait entirely worth its while.As stated, the road to the battle of Helm's Deep can be enormously long and painful for any viewer aware of what breathtaking scenes await towards the end of the film. Perhaps The Two Towers' biggest fault is in its own accomplishments; the first two thirds of the film are well shot, well paced, and they necessarily and adequately progress the storyline, but when compared to the spectacular final hour, the first two hours seem uneventful and insignificant. However, to be fair, I feel that it's simply impossible to create two hours of film that could appropriately lead into the battle of Helm's Deep. It's difficult to comprehend how such scenes came to exist in the rather short amount of time Peter Jackson has had to create six hours (so far) of finished film. The battle of Helm's Deep is simply unreal; it's unlike any event that has come to pass since fantasy films gained, and regained, popularity.As assumed, The Two Towers begins where The Fellowship of the Ring ended. The majority of the film follows four separate groups and their story lines: Frodo and Sam; Aragorn and Legolas, Merry and Pippin, and Saruman and his army. The performances live well up to the standards of the first film, with a particularly notable performance from Viggo Mortensen as Aragorn, whose role is significantly larger in The Two Towers. Aragorn satisfies a thirst for someone to root for, a thirst that was left partly unquenched in Fellowship. It's much easier to root for Aragorn than it is for Frodo; Aragorn has many more qualities of a leading man, a soldier, and a hero. More than once did the audience, filled mostly with academy voters, applaud the heroics of Aragorn. Gollum also shines in a much-welcomed large role, due to extremely realistic computer animation, and a fine performance from Andy Serkis, upon which the animation was modeled. In Fellowship, it was appropriate to consider Gollum one of the many great 'features' of the film. However, here he is more of a leading character and a 'star,' and his convincing dual-personality, stabbing voice, and well-choreographed body movements make him consistently eye-grabbing and the center of focus of nearly every scene in which he appears.As was The Fellowship of the Ring, The Two Towers is a visual delight. Those who have seen Fellowship are no doubt familiar with the beauty of the landscapes of New Zealand. The cinematography is, again, one of the best aspects of the film. The swooshing camera movements that follow the armies and horsemen throughout the fields are extremely satisfying in this post-Matrix era. The shots of the ascending enemy-laden ladders in the battle of Helm's Deep are terrifying and chillingly gorgeous all at once. The visual effects take an appropriate leap forward from those of the first film. While the visual effects in Fellowship were outstanding, the battle of Helm's Deep provides for the best application of CGI since the rippling waves of The Matrix's 'Bullet Time.' The battle of Helm's Deep features absolutely awe-inspiring and seamless integration of acting, stunts, and computer animation. Each orc seems to have its own personality, demonstrated in its movements and visual features. The masses of armies fight with strategy and true character, which I imagine is much harder to accomplish than animating thousands of identical clone troopers. The only problem I have with the visual department is the look of Gimli, the Treebeard. Gimli's visual features seem a bit childish and uninspired, inconsistent with the standards set by the rest of the film. But again, there is simply nothing that compares to the battle of Helm's Deep. George Lucas and the Wachowski brothers certainly have not created anything that approaches the grandness and magnificence of The Two Towers' final hour, and I doubt they will do so anytime soon.In The Fellowship of the Ring, I had a few minor problems with Howard Shore's score. While I thought it was gorgeous and it established several very memorable themes, I don't think it handled the sentimental scenes (opening in the Shire, Gandalf's passing) properly. I thought it caved in to the melodrama a bit too much, resembling the emotions from James Horner's Titanic. However, I believe that The Two Towers requires the type of score which Howard Shore accomplishes best: dark, continuous, and unrelenting, as demonstrated in Se7en and Silence of the Lambs. The theme used in many of the action scenes in Fellowship (low brass, six notes repeated with a rest in between) is much more present in The Two Towers, appropriately. A brand new theme is also unveiled, the theme for Rohan, a prominent kingdom in Middle Earth. Rohan's theme is played more often than any other melody in the film, underscoring most of the memorable and heroic scenes with great effect. Howard Shore undeniably exhibits his skills as an 'A-list' composer, and with a possible double Oscar nomination this year for The Two Towers and Gangs of New York, he could get propelled to the very top of the 'A-list,' right beside John Williams and Hans Zimmer in terms of demand.If not the picture itself, there should be a way to recognize and award the battle of Helm's Deep. The battle sequence alone represents successful filmmaking in its highest form. The choreography of the battle, the visual effects, the pacing, acting, cinematography, and music, all work together in perfection to achieve grand filmmaking which is as entertaining and enjoyable as film can be. For this very reason, no one, whether a fan of Fellowship or not, should miss The Two Towers.",
            "Great movie I really enjoyed watching and better than the first part"
        ]
    },
    {
        "title":"Forrest Gump",
        "url":"https:\/\/www.imdb.com\/title\/tt0109830\/",
        "rating":"8.8\/10",
        "plot":"The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man with an IQ of 75, who yearns to be reunited with his childhood sweetheart.",
        "director":"Robert Zemeckis",
        "cast":[
            "Tom Hanks",
            "Robin Wright",
            "Gary Sinise",
            "Rebecca Williams",
            "Sally Field"
        ],
        "release_year":"1994",
        "duration":"2h 22m(142 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDYwNzVjMTItZmU5YS00YjQ5LTljYjgtMjY2NDVmYWMyNWFmXkEyXkFqcGc@._V1_QL75_UY281_CR2,0,190,281_.jpg",
        "comments":[
            "When I first saw this movie I didn't appreciate it like I do now. I think it may have been because I was so young when I first saw it. Just recently I saw the movie again. What an amazing story and moving meaning. That movie teaches you so much about life and the meaning of it. That life isn't as bad as most people make it seem. That an innocent man can impact so many lives with his innocence. The meaning of the movie to me is that everyone needs to have a better outlook on life. That we need to appreciate more of the little things and not let the big things hold us back. That truly although life may throw us trials and tribulations like a box of chocolates but that we have to just bite into it and get through it even if we don't like it. That we all need to hold true to our values and not sink into a place that feels like there's no hope... I just love this movie. And anyone who hasn't seen it or who thinks that don't like it I seriously suggest seeing it or seeing it again. It truly is amazing...",
            "... seems to be the theme of this film. Forrest Gump has an IQ of 70, is being raised by a single mom, lives in a remote part of the Deep South where there are few opportunities, and has legs that require that he wear braces as a child. Sounds like the recipe for a sad tale or at least a slow death from mediocrity right? No, instead, because Forrest isn't really bright enough to realize the situation he is in, he simply does what he's told to do or what occurs to him to be the right thing at the time and succeeds due to a lack of self doubt. He's told to run and he becomes the star of the Crimson Tide and an All American. When recovering from a war wound, he's taught ping-pong and winds up competing at the global level in China itself. He promises his dying friend Bubba that he'll go ahead with their plans and become a shrimp boat captain and his brand of seafood products becomes a household name.All along the way he never learns the lessons in life that tend to make the rest of us cynical.Gump's childhood sweetheart Jenny starts out with high aspirations - she wants to be like Joan Baez and fight for world peace - and instead she winds up disillusioned, drug addicted, and a near suicide before age 30. She doesn't have Forrest's childlike innocence and this leads her to self-doubt and ultimately failure. Also, fate or \"destiny\" as the film calls it, is not on her side in one big way - her own father molested her as a child, which couldn't help but play a role in the decisions she made.Now Gump does have a bunch of coincidences on his side - call it destiny if you will - the storm that beaches every shrimping vessel in the Gulf of Mexico but his, for example - but in most cases this is just the story of a man going through life without self doubt and that little voice that tells the rest of us \"You can't do that! What are the odds! You'll fail! Make the safe choice!\" To me, this is what this film is about. I think everyone sees something different in it. I highly recommend it as it is truly one of a kind. I remember when it came out it absolutely made professional reviewers crazy that people liked this film, probably because they didn't understand it.",
            "This is a powerful yet charming movie; fun for its special effects and profound in how it keeps you thinking long after it's over. Like others, I've seen this movie more than once. One comment I've never heard is that Forrest's simplicity is almost zen-like. I should read the novel to get the author's intention (I remember some people preferring the book and complaining that no one at the Academy Awards gave him any credit.) But rather than an implication that you should do what you're supposed to do and believe in God and you'll win in the end, I see it as zen-like, i.e., living in the moment and not having expectations or particular cravings (other than his loving Jenny.) So he ends up just stumbling into all the major historical events of the time. Granted, he achieves this only because he doesn't have the brains to think otherwise and actually have expectations, but so many of our problems are because we do have higher intellect and desires, which ironically makes us unhappy because we know what we are missing. We love our cats and dogs for the same simplicity and always being in the moment. There's a line in the movie wondering if everything is predestined or happens randomly or it's a combination of both. It is something to mull over for a long time."
        ]
    },
    {
        "title":"Fight Club",
        "url":"https:\/\/www.imdb.com\/title\/tt0137523\/",
        "rating":"8.8\/10",
        "plot":"An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
        "director":"David Fincher",
        "cast":[
            "Brad Pitt",
            "Edward Norton",
            "Meat Loaf",
            "Zach Grenier",
            "Richmond Arquette"
        ],
        "release_year":"1999",
        "duration":"2h 19m(139 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOTgyOGQ1NDItNGU3Ny00MjU3LTg2YWEtNmEyYjBiMjI1Y2M5XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
        "comments":[
            "Fight club is not at all what I expected, but I was surprisingly ecstatic about what the movie was. A terrifically made thriller that builds suspence and keeps you invested throughout the entirety of the film. Be warned the film is incredible through the first watch and provides a different perspective the second time.",
            "I have no words about this film. This is masterpiece cult film.10 \/ 10.",
            "Because you'll probably be confused the first time around. It's not a coincidence it stars some of the greatest actors of our time."
        ]
    },
    {
        "title":"Inception",
        "url":"https:\/\/www.imdb.com\/title\/tt1375666\/",
        "rating":"8.8\/10",
        "plot":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a CEO, but his tragic past may doom the projec...Read all",
        "director":"Christopher Nolan",
        "cast":[
            "Leonardo DiCaprio",
            "Joseph Gordon-Levitt",
            "Elliot Page",
            "Tom Hardy",
            "Ken Watanabe"
        ],
        "release_year":"2010",
        "duration":"2h 28m(148 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
        "comments":[
            "Few films leave you genuinely questioning whether you truly understood them quite like Inception does. The cast is outstanding, the story itself feels like a puzzle you can't stop trying to solve, and the music subtly pulls you deeper without overpowering the experience. All of this has drawn me back to watch the movie at least five times over the years - and I know I'm not done yet.I've always admired Leonardo DiCaprio, and in this film, it feels like he poured everything he had into the role. All that's left for me now is to keep hoping that someday, we'll get a second part.So, keep dreaming....",
            "There are those who seek to dive into your mind, take your secrets and whatever else they find, espionage, conspiracy, infiltration, skulduggery, through worlds that are all conjured, well designed. They've been asked to plant a seed, start an idea, change the course of an industrialists career, but it needs dreams within deep dreams, an architect to build the schemes, and the consequences, could be quite severe.Imaginative beyond words, elegantly crafted and constructed, presented and performed by legends of the screen with a great storyline that keeps the viewer constantly engaged and on the edge of their seat - what more do you want out of movies.",
            "When I first watch this movie, I was just shocked with it's twist. I'm not gonna mention details, because can't share any spoilers.Simply this movie makes a complex story, that makes you question so many things. \"Why he is keeping her in his dreams?\" or whatever your question is answering with some well written line. That scene is the key to the whole movie. That line between Cobb and Mal answers all your questions at once.That's why I like this movie so much. Some movies has that potential. Making a complex story that someone could answer with only one sentence. You're waiting for that line for whole content. But most of the contents (I mean movie or TV Series) are not managing that well.Besides the greatness of the storyline this movie has a really great cast. So Acting Performances are also great. Award Winning Cinematography by Wally Pfister was too great. Original Scores by Hans Zimmer was brilliant. Visual Effects are unique. So not only the Screenplay but nearly all the technical details are great."
        ]
    },
    {
        "title":"Star Wars: Episode V - The Empire Strikes Back",
        "url":"https:\/\/www.imdb.com\/title\/tt0080684\/",
        "rating":"8.7\/10",
        "plot":"After the Empire overpowers the Rebel Alliance, Luke Skywalker begins training with Jedi Master Yoda, while Darth Vader and bounty hunter Boba Fett pursue his friends across the galaxy.",
        "director":"Irvin Kershner",
        "cast":[
            "Mark Hamill",
            "Harrison Ford",
            "Carrie Fisher",
            "Billy Dee Williams",
            "Anthony Daniels"
        ],
        "release_year":"1980",
        "duration":"2h 4m(124 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTkxNGFlNDktZmJkNC00MDdhLTg0MTEtZjZiYWI3MGE5NWIwXkEyXkFqcGc@._V1_QL75_UX190_CR0,7,190,281_.jpg",
        "comments":[
            "So much amazing action and beautiful cinematography makes for such an enlightening experience! In The Empire Strikes Back you know who everyone is which is great plus Yoda is introduced! I love this movie the music is soothing, there's romance, more of Darth Vader, and introduces Emperor Palpatine what more can you ask for? A lot to relish and get excited about; it's such a classic gem.",
            "This film changed the game forever. The people behind the scenes took an exciting science fiction adventure film with a happy tone where the heroes have a happy tone throughout and throwing that on its side. Throughout the film the rebels are in a constant rush and panic, pushing the viewers to the edge of their seat wondering if the heroes would make it to the end okay. This is done brilliantly by splitting up the heroes putting them in a worried state for one another. As well as that the rebels are all tested as they go through their own personal trails and try to find their way through.\nEven though this might put you on a constant worry for the characters the movie is paced perfectly with breathers and amazing storytelling by the characters to fill in anything we need answers for.\nThat is just the story, the film also has gorgeous cinematography, going from the AT-ATs on Hoth, to the Imperial pursuit of the Falcon through the asteroid field, all the way down to the beautiful shots of the final battle in Cloud city. Even though we as viewers are worried for the rebels, the imagery is jaw dropping. \nThe imagery is further enhanced by the most popular score of all time, John Williams delivers his best work ever as it has stuck with people their entire lives and is recognizable by even those who haven't seen the film. \nThe film was released in 1980 and all of the set design and special effects still hold up to this day as they are just as convincing now as it was apon first watch for everyone in the past 38 years.",
            "An excellent sequel to Star Wars, this is easily the darkest and most serious out of all the Star Wars films, at least until Revenge of the Sith comes out. This movie benefits from the introduction of Yoda, a diminutive yet wise Jedi master who helps Luke prepare for his showdown with Darth Vader. It also introduces Lando Calrissian, Han's old gambling and smuggling buddy played very well by Billy Dee Williams. Empire is more character driven than the original and relies more on comic relief to help lighten the mood, but it doesn't go overboard with the humor. The story is more refined and the acting is better as well. Despite all of this I can't really say that I enjoyed Empire more than the original. The original Star Wars has a certain charm to it that none of the sequels (or prequels) have captured. I'd say that it is at least on par with the original though and is a fitting follow up in what is probably the greatest series of movies in the history of cinema."
        ]
    },
    {
        "title":"The Matrix",
        "url":"https:\/\/www.imdb.com\/title\/tt0133093\/",
        "rating":"8.7\/10",
        "plot":"When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
        "director":"Lana Wachowski",
        "cast":[
            "Keanu Reeves",
            "Laurence Fishburne",
            "Carrie-Anne Moss",
            "Hugo Weaving",
            "Gloria Foster"
        ],
        "release_year":"1999",
        "duration":"2h 16m(136 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BN2NmN2VhMTQtMDNiOS00NDlhLTliMjgtODE2ZTY0ODQyNDRhXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
        "comments":[
            "The first 45 minutes of this film had me very excited. It is so rare that I will go to the theater and be presented with something which is both original and intelligent. It managed to hang in there throughout, though the ending was too formulaic. In addition, the voice-over at the very end reminded me of the final scene in Saving Private Ryan. It almost ruins a fantastic film.The only other objection I can come up with is that the you must know, you must be type philosophy being handed out was just a tad hokey. I must pleasantly admit though, since I don't get to admit this very often, that The Matrix is worth seeing despite these things.The visuals are extremely impressive, particularly the \"white room,\" the baby harvester, the training scene with the \"red woman,\" the Reeves interrogation scene... I have to agree with some of the previous comments that the plot idea won't seem overly original to a fan of Philip K Dick, but then what is original after you've read him? The Matrix has more original things to say than two months worth of standard Hollywood fare. I have a great deal of respect for a film which will have someone say \"they're turning humans into this\" and hold up a battery. A plot which looks at man as machine will get a thumbs up from me just for trying.I feel some hope for the future of movie-making in America to be able to recommend this film.",
            "At first, I wasn't interested in seeing the Matrix. But after hardly hearing any bad reviews for it (and believe me, I hear bad reviews for every movie I enjoy) I decided to give it a try. At first, although I really loved the fights, graphics and characters, the plot confused me. (Anyone confused by the plot at all should go to www.knowthematrix.com and you'll find out everything you could want to know) By the second time I watched it, I really understood it, which made the movie even more enjoyable.I really loved this movie. Just about every character, good or bad, is very interesting and cool. The acting was excellent. Even though I think this was Keanu Reeves at his best, the best acting jobs were done by Laurence Fishburne (Morpheus) and Carrie-Anne Moss (Trinity). Hugo Weaving did an excellent job as Agent Smith and Joe Pantoliano was great as Cypher as well.The plot is one of the best movie plots I've seen in a movie. An accountant by day, computer hacker by night guy suddenly finds out that reality as we know it is fake and that we are actually in a giant computer program run by robots (that we created, of course) in order for them to get power. Not only that, but he finds out that he is one who is, according to prophecy, going to put an end to it. The greatest thing is that you learn things just as Neo does, so you can really relate to his character.My favorite thing about this movie is that no matter how many times you watch it, you will learn more about it. I guarantee this. Some may not like this movie because the plot is too complicated, but I recommend that anyone who enjoys movies should go buy this one right away.",
            "The Matrix - 1999This was a real change in filmmaking. Like watching it again in 2020, i.e. after 21 years and it still feels fresh. Iconic scenes are still having benchmarks setting up.If we say it sci-fi at its best, it won't be wrong. The hype was real, it is still not easy to match the level of Matrix where we experience the connection of humans and science, that too with amazing action fight and chase scenes, not just normal scenes they were, multiple exposures, slow motion 3D moves, Oh My God, and it's understandable as well like what are the characters up to and what storyline they are entering into. The script was very well written and executed otherwise it could have been a mess. A special appreciation in managing the theme with those black color costumes and a scientific zone with unimaginable equipment and props doing unbelievable things in the two worlds created. No spoilers, but the action scenes in the climax where the protagonist goes to save someone from agents are really breathtaking. The technology used at its best.A salute to Wachowski Brothers and the team for creating this masterpiece. It will be a great competition and motivation as well for many films coming in the future."
        ]
    },
    {
        "title":"Goodfellas",
        "url":"https:\/\/www.imdb.com\/title\/tt0099685\/",
        "rating":"8.7\/10",
        "plot":"The story of Henry Hill and his life in the mafia, covering his relationship with his wife Karen and his mob partners Jimmy Conway and Tommy DeVito.",
        "director":"Martin Scorsese",
        "cast":[
            "Robert De Niro",
            "Ray Liotta",
            "Joe Pesci",
            "Lorraine Bracco",
            "Paul Sorvino"
        ],
        "release_year":"1990",
        "duration":"2h 25m(145 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BN2E5NzI2ZGMtY2VjNi00YTRjLWI1MDUtZGY5OWU1MWJjZjRjXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
        "comments":[
            "'Goodfellas' is a masterpiece, pure and simple. While not my favourite Martin Scorsese movie it is a stunning achievement, and one of his very best movies. The film is stunning technically. The consistently fine acting by the large ensemble cast (both known and unknown), the cinematography, editing, dialogue, brilliant use of music, it's all breathtaking. But Scorsese and co-writer Mitch Pileggi never lose lose sight of their main goal - to tell a story. And in that it's really hard to beat this movie. As to the actors De Niro is on top form, Ray Liotta is the best he's ever been, and this is Joe Pesci's definitive performance. Plus you have Lorraine Bracco, Paul Sorvino, Michael Imperioli, and lots of well known faces in small but important roles (Debi Mazar, Samuel L. Jackson, Illeana Douglas, Kevin Corrigan), plus dozens of unfamiliar actors (and non-actors) who are all so good it seems unfair just to single out the \"stars\". (Also keep an eye out for Vincent Gallo in a few scenes. He has no lines, but looks cool!). 'Goodfellas' is (to date) Scorsese's last Great Movie, and one of the very best films of the 1990s. Absolutely essential viewing for any movie fan, this tremendous film is not to be missed! Highly recommended!",
            "The gangster film has been redefined so many times in cinema history it will be interesting to see how it is redefined once again. Goodfellas is a milestone film in that regard because just as Public Enemy and Little Caesar defined it in the Thirties, The Godfather trilogy in the seventies and eighties, Goodfellas set the standard that all other films including Martin Scorsese similar Casino try to meet. The interesting thing is that Martin Scorsese is young enough to redefine it again with another work.With Ray Liotta narrating his own life in crime in a flashback as real life criminal Henry Hill, Martin Scorsese offers us one fascinating glimpse of the criminal life in the Eisenhower to Reagan era. Henry Hill even as a child got sucked into the criminal life as a kid, as he said all he ever wanted to be was a gangster. Tutored by both Robert DeNiro and Paul Sorvino, Liotta takes part in one of the biggest heists of all time of Lufthansa Airlines at JFK Airport during the seventies. Goodfellas is the story of the events from Henry Hill's perspective leading up to the heist and the aftermath.For myself I've never seen the gangster mentality better expressed on screen except maybe by Sean Connery in Family Business. Liotta and Connery operate from the same mindset. If you work hard and hope it pays off in success, you're a dope. If you want something, just take it. When you come right down to it, that's how criminals think, it's the rest of us who are fools.Goodfellas was nominated for several Oscars, but came away with only one winner, Joe Pesci in the role of crazy Tommy DeVito. He's another criminal type, one who's driven by a terrible inferiority complex due to his short stature and does terrible things even to his own peers. And those peers don't forget as you see what happens to Pesci in Goodfellas. This turned out to be a career role for Pesci. He's a multi-talented man who's got an incredible range and can play everything from the Home Alone comedies to stone killers like here in Goodfellas or in Casino.There's usually a contest in which Scorsese fans argue whether Casino or Goodfellas is better. I happen to like Casino, but without the success of Goodfellas, Casino would not have been made.For a fascinating look at the criminal mindset, Goodfellas is an absolute must.",
            "\"GoodFellas\" may be the most important film of the 1990s in the fact that its incredible success led to some of the other great movies of the decade. Films like \"The Silence of the Lambs\", \"The Crying Game\", \"Pulp Fiction\", \"The Usual Suspects\", \"Fargo\", and \"L.A. Confidential\" would have likely never been made as well as they were without the influence of Scorsese's \"GoodFellas\".  The film is an intense study of a Mafia family over a 30-year stretch.  Ray Liotta plays the half-Irish, half-Sicilian kid from Brooklyn whose only dream is to be a gangster.  Although Liotta's story is at the heart of \"GoodFellas\", it is the supporting cast that is the film's calling card.  Robert DeNiro gives one of his greatest performances, Paul Sorvino is quietly effective, and Lorraine Bracco (in an Oscar-nominated role) does the best work of her career.  However, it is Joe Pesci (in his well-deserved Oscar-winning turn) who steals every scene as the one who does the \"dirty work\".  This is probably the definitive film in a decade that produced many film-noir styled classics.  5 stars out of 5."
        ]
    },
    {
        "title":"Interstellar",
        "url":"https:\/\/www.imdb.com\/title\/tt0816692\/",
        "rating":"8.7\/10",
        "plot":"When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans.",
        "director":"Christopher Nolan",
        "cast":[
            "Matthew McConaughey",
            "Anne Hathaway",
            "Jessica Chastain",
            "Ellen Burstyn",
            "Mackenzie Foy"
        ],
        "release_year":"2014",
        "duration":"2h 49m(169 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYzdjMDAxZGItMjI2My00ODA1LTlkNzItOWFjMDU5ZDJlYWY3XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
        "comments":[
            "After watching this insane movie in the theatres back in 2014 I swore to god I will wait 5 years to watch it again so I get to forget it and experince the insanity it has again\nThis without doubt is THE BEST MOVIE EVER MADE",
            "Interstellar is a movie like no other. Unlike many apocalyptic sci-fi films that feature advanced technology as the source of our destruction (ala The Terminator movies), it instead asserts that technology will save us.Not everyone in Interstellar recognizes the potential of advanced technology. Most dismiss it as a waste of time and resources, and not just old curmudgeons feel this way. Thoughtful, intelligent young characters share this sentiment. This belief gained steam following a world-wide blight that wiped out the vast majority of life on earth—crops and humans.Farming became paramount while advanced technology was deemed frivolous. Cooper (McConaughey) remains one of the few survivors who still appreciates the need for engineering. He feels like a man lost in time, until he stumbles into the headquarters of NASA (which had been operating in secret due to public disapproval). Here he meets others who realize that a return to our old ways is unsustainable and will ultimately lead to our demise. We need technology to save us. As Michael Caine, playing the brilliant (duh!) Professor Brand, eloquently tells Cooper, \"we were never meant to save the world. We were meant to leave it.\" For a movie that won an Oscar for Best Visual Effects (and deservedly so) the sound stole the show. Hans Zimmer (Dark Knight Trilogy) unleashed a performance that was, quite appropriately, out of this world. Never have I seen a movie elevated so much by its score. The sound literally took my breath away. Forgive me for the next paragraph. I will gush irresponsibly about the magic that is this movie's sound. Skip it if you please. You have your warning.The music fueled every important scene. In every meaningful moment Zimmer's harmonies captivated watchers' attention in the way of a coach commanding a locker room with a pregame speech. The music elucidated those emotional scenes, particularly ones featuring Cooper and his daughter, in a way that no words or visual ques possibly could. I sat frozen, jaw agape, with tears pouring down my cheeks as the music completely overwhelmed my emotions. The sound penetrated my soul and reverberated through my body, flowing to my appendages, supplying me with life like a heartbeat pumping blood through my veins. The music was truly the life force of movie.Yes, we all witnessed a visual triumph, a daring creative wonder the likes of which we haven't encountered since Inception. Yes, nearly every actor's performance proved worthy of commendation. McConaughey is on fire. Chastain is blossoming into a star. At this point Michael Cain exudes such knowledge and wisdom by merely appearing on screen that if he were cast as Albert Einstein, people would wonder if the role were beneath him. All this considered, and the sound still towered over everything.I walked out of the theater believing that I had experienced something unique, something truly special. Interstellar inspires, it awes, and above all it entertains. I cannot ask for more than that.",
            "Sometimes I just need to see the start. Or end. Or a trailer. Or the music and theme from Hans Zimmer. Or the whole movie. Just to feel that thing, I only get from this movie. That the earth, space and time are something special, mystical. I never forget the first time I saw this movie, in an IMAX theatre in 2014. I was struck by it. Totally got me. And it stil does, 7 years later. This is the best movie ever made for me. Because of the feeling it gives me, no other movie can. So hard to get all of this emotion in only one movie. Brilliant."
        ]
    },
    {
        "title":"One Flew Over the Cuckoo's Nest",
        "url":"https:\/\/www.imdb.com\/title\/tt0073486\/",
        "rating":"8.6\/10",
        "plot":"A rebellious convict is sent to a psychiatric hospital for evaluation in 1963 Oregon, and encourages his docile companions to take more control of their lives and defy the tyrannical head nu...Read all",
        "director":"Milos Forman",
        "cast":[
            "Jack Nicholson",
            "Louise Fletcher",
            "Michael Berryman",
            "Peter Brocco",
            "Dean R. Brooks"
        ],
        "release_year":"1975",
        "duration":"2h 13m(133 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYjBkMjgzMzYtNzRiMS00NDc3LWE4YTUtZjYxYjZhNjNhYzhhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
        "comments":[
            "Czech director Milos Forman seems to be obsessed with rebellious characters that don't like to go with the flow. Just think about Larry Flynt in \"The People vs. Larry Flynt\" or Andy Kaufman in \"Man on the Moon\", in the two most recent movies of Forman. The central character in \"One Flew Over the Cuckoo's Nest\" played by Jack Nicholson is also one of those characters, that wants to break the routine and even starts a revolt against the staff and nurse Ratchett in particular, in a mental institution.The movie is perhaps more comedy and entertainment than heavy drama. Still that doesn't mean that the movie isn't filled with some powerful emotional sequences. The tension between the patients and the staff gets more and more notable and grows throughout the movie, which eventually leads to a 'wonderful' ending which I'm not going to spoil.Yes, Jack Nicholson is truly splendid in his role and it seemed like he was improvising all his lines and actions during the entire movie. It was a really Oscar worthy performances, which he also received. Another Oscar winner for her performance was Louise Fletcher, which in my opinion is a bit too much credit. She plays her role well but nothing more than that. She did not deeply impressed me or anything. This movie also marks the debut for some today well known actors such as Danny DeVito (he looked so young and different!), Christopher Lloyd and Brad Dourif, who also received an Oscar nomination.Really one of those movies that you must have seen at least once in your life.9\/10http:\/\/bobafett1138.blogspot.com\/",
            "I went into this film with the knowledge that it had been the second film in history to win the 'top five' Oscars (for Best Picture, Best actor, Best actress, Best director and best screenplay) and has been praised as \"one of Jack Nicholson's finest roles\" and \"one of the classics of the 70's\". Naturally, after hearing all this, I had high expectations for One Flew over the Cuckoo's Nest. But nonetheless, I was surprised at how easily the film surpassed my expectations and easily led me to understand how it merited all that praise.Based on the novel by Ken Kesey, the story follows Randle Patrick McMurphy (Jack Nicholson), who, in an attempt to get out of spending more time in prison, pleads insanity for his crime, and is therefore sentenced to time in a mental institution. This was McMurphy's intention, as he believes the conditions in a \"crazy house\" will be significantly easier to contend with than another harsh stay in prison. However, he quickly finds out that surviving the institution with it's desolate patients (including Christopher Lloyd, Danny DeVito, Vincent Schiavelli and an absolutely brilliant Brad Dourif as the stuttering Billy Bibbit) and the monstrously repressive Nurse Ratchet (Louise Fletcher, in a career defining role) is considerably harder than he imagined. McMurphy plays pranks, horseplay, and is generally defiant to the rules of the institution in an attempt to raise spirits. His constant optimism and reckless defiance to the out of date rules in the institution can be very uplifting, and often quite funny as well, but much of the movie can be very depressing - the generally decrepit state of the institution is a consistently (and intentionally) bleak background to a superb story with a truly bittersweet ending.Jack Nicholson is at his best here, head and shoulders above other excellent performances such as in 'Chinatown' or 'As Good as it Gets'. McMurphy is an apparently unquenchable optimist, refusing to succumb to the defeated spirit of all the other patients. His livewire antics, inspiring the patients are generally uplifting, and when his indomitable spirit is finally broken, we really feel for him and his fellow patients. Nicholson conveys the essence of McMurphy to perfection, demonstrating his excellent understanding and interpretation of the character. When McMurphy announces that he is going to lift a huge stone fountain and hurl it through the window to escape, the other patients are so caught up in his intoxicating spirit of freedom that they honestly believe he can do it, despite the fact it would be impossible for a man much stronger than him. When McMurphy finally discovers that despite his best efforts, he cannot lift the fountain, he is so openly crushed that we can't help but feel for him. Beneath the frequent profanities and livewire antics, there are real human emotions, which come across as truly touching.What can be said about One Flew over the Cuckoo's Nest which hasn't already been said? It has an excellent storyline, top notch acting, painfully bleak visuals, perfectly setting the tone for the movie, and alternates between being truly uplifting to devastatingly depressing. It features perhaps the most memorable film ending ever, next to a man on his horse riding off into the sunset, and leaves the viewer beaten down by the conflicting emotions, unaware what to think of the picture next to reveling in it's glorious entirety. It's hard to produce a final outcome any better than this.-10\/10",
            "It's tough to really judge this movie. Is it Milos Forman's greatest directorial masterpiece or Jack Nicholson's best performance. Tough to say, but the marriage between both director and actor are quite phenomenal. From the first time we see Jack Nicholson to the sad, yet uplifting ending, one cannot escape the sheer power of the film. When a film is parodied as many times as this one has been, typically, greatness can be associated. Well, greatness was achieved, and let's hope this one never falls through the cracks."
        ]
    },
    {
        "title":"Se7en",
        "url":"https:\/\/www.imdb.com\/title\/tt0114369\/",
        "rating":"8.6\/10",
        "plot":"Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.",
        "director":"David Fincher",
        "cast":[
            "Morgan Freeman",
            "Brad Pitt",
            "Kevin Spacey",
            "Andrew Kevin Walker",
            "Daniel Zacapa"
        ],
        "release_year":"1995",
        "duration":"2h 7m(127 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BY2IzNzMxZjctZjUxZi00YzAxLTk3ZjMtODFjODdhMDU5NDM1XkEyXkFqcGc@._V1_QL75_UX190_CR0,8,190,281_.jpg",
        "comments":[
            "Seldom does a film elucidate the culpability of our culture,of our society, in the mayhem and madness we often find in everyday life. According to Se7en, our culture is drifting through darkness. The mouthpiece for this thematic undercurrent is Somerset, a literate man who also happens to be a detective, a man who can read a clue (\"This isn't going to be a happy ending\") or Dante's Inferno with equal aplomb. He even provides the film's final thematic statement with a quote from Hemingway. His quirkiness, perhaps the outgrowth of a brilliant mind, is no worse than that of any prophet or seer of old, those harbingers of Biblical insight whom others always find kooky and offbeat. He is not well loved for his cynical, pessimistic outlook (such that his consuming motivation is to retire and get out of town). However, by the end it becomes clear that it is Somerset who sees our dark world with the prophet's particular clarity. (It is left to his partner Mills to find this out the hard way).Working on us to reinforce this world as Somerset sees it is the film's astounding mise-en-scene, a disturbing film-noir setting developed by director David Fincher and cinematographer Darius Khondji. Flashlights barely illuminate the slimy walls of the roach-infested tenement of one victim and the dark bedroom of another. Rain pours down in buckets. Bird's-eye-view shots of downtown (the city is never named- a generic, everyman's kind of place) show dingy, sooty rooftops and grimy streets. Only the film's closing scene is in bright sunlight, which by then only serves as ironic counterpoint to what we see happening.This is Somerset's vision; both inhabited and described by him. He finds a surprising fellow traveler in, not his partner, but the elusive killer John Doe. Doe shares the vision and provides an unsettling echo to the rumblings and teachings of Somerset. If one looks at life through the Somerset lens, one must admit that John Doe has a valid point. He and Somerset have arrived at the same conclusion, the difference between them being how they have responded. (Somerset longs to escape to some otherworldly realm in the country. Doe has taken action.)Though gripping and fast moving, this is not an action film. It holds our interest through the workings of horror and mystery: a stark, film-noir detective piece. Except for one tense pursuit through halls and alleys in pouring rain, as well as the bit of ending action, there is surprisingly little violence. We see each murder, save two, after the fact, as a crime scene. This only makes the final act that much more suspenseful.This is a very tight film. Elements within: dialogue, actions, lighting, setting, all of these tend to reinforce one another to paint a solid picture. It is a perverse logic that makes the final and seventh sin complete perfectly the circle of events begun with the first.",
            "After his calamitous experience working on his début film Alien 3 (1992), David Fincher took on a small genre picture that, little did he know, would revitalise his career and become one of the greatest films of the 1990's. Se7en appears to begin as your typical detective neo- noir, with the cynical veteran and the naive rookie taking on an elusive serial killer seemed hell-bent on turning the sin against the sinner. But, set in an unnamed and permanently drizzly American city, Se7en is a meditation on evil and a pessimist's depiction on the modern world, climaxing in one of the bravest and most memorable endings in Hollywood history.Detective Somerset (Morgan Freeman) is on the verge of retirement, where he plans to leave his inner-city life behind him after years of fighting on the side of good. His replacement is the brash Detective Mills (Brad Pitt), an optimistic young recruit eager to learn, who Somerset takes under his wing. Their first homicide investigation involves an obese man who has been fed at gunpoint to the point of causing his stomach to rupture. With Somerset ready to leave the force, Mills takes on his first solo case in the murder of a rich attorney, a man forced to cut a pound of flesh from his own body. The murder scene has the words 'greed' written in blood. Somerset eventually finds the word 'gluttony' etched in grease in the apartment of the first victim, and he becomes convinced the murders are connected, and that the killer is murdering under the guidance of the seven deadly sins.The genius of Se7en is rooted in the way the movie keeps the audience as clueless as the detectives. Normally in genre pictures such as this, we either know who the killer is and eagerly wait for the investigators to put the pieces together, or we have a line-up of suspects and red herrings to decide from. Here, apart from brief glimpses during a thrilling chase scene, we are devoid of clues. The killer is always one step ahead of Somerset and Mills, alluding to the idea that the mysterious 'John Doe' is indeed having his work guided by a higher power. Of course, he is not, he is merely a man, but this helps gives Se7en dramatic weight, rather than it becoming a nihilistic exercise in cruelty.When, three-quarters of the movie in, the killer hands himself in, the movie becomes a masterclass in writing, slowly building into one of the greatest climaxes in film. Somerset, a decent man who has devoted his life to the side of good but has had the fight slowly drained out of him, meets his nemesis in John Doe (Kevin Spacey). But as they talk, Doe's reasoning becomes clear and, shockingly, almost sympathetic. \"Wanting people to listen, you can't just tap them on the shoulder anymore, you have to hit them with a sledgehammer,\" he says. It's about a world gone to s**t, a view shared by Mills' wife Tracy (Gwyneth Paltrow), who talks to Somerset in a diner about allowing a baby to be born into the world after discovering she is pregnant. Cerebral and Gothic, Se7en transcends the genre on so many levels thanks to some bleak yet stylish direction by Fincher, and it still manages to astound after almost 20 years of repeat viewings.www.the-wrath-of-blog.blogspot.com",
            "David Fincher's bleak, relentless, and ultimately terrifying crime thriller Seven transcends other films of the genre with incredible plotting (the sort Hitchcock might employ were he alive and making films in the 1990s) and scalding intelligence.  With only a small handful of minor flaws -- the overly familiar retiring cop\/young cop pairing; the awful \"I'm taking you off the case!\" cliche seemingly required by the genre; one giant lapse in logic in the downward spiral toward the conclusion that cannot be revealed without ruining the script's gruesome surprise -- Seven typically keeps its viewers imprisoned in their seats with a combination of morbid fascination and abject fear.  Despite attempts by studio executives to alter Andrew Kevin Walker's ending, the filmmaking team prevailed and audiences experienced that rare treat of mainstream cinema: an uncompromising vision."
        ]
    },
    {
        "title":"It's a Wonderful Life",
        "url":"https:\/\/www.imdb.com\/title\/tt0038650\/",
        "rating":"8.6\/10",
        "plot":"An angel is sent from Heaven to help a desperately frustrated businessman see the value of his own life.",
        "director":"Frank Capra",
        "cast":[
            "James Stewart",
            "Donna Reed",
            "Lionel Barrymore",
            "Thomas Mitchell",
            "Henry Travers"
        ],
        "release_year":"1946",
        "duration":"2h 10m(130 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMDM4OWFhYjEtNTE5Yy00NjcyLTg5N2UtZDQwNDZlYjlmNDU5XkEyXkFqcGc@._V1_QL75_UY281_CR2,0,190,281_.jpg",
        "comments":[
            "No movie ever made has influenced me more than this classic. I had the honor of doing a play version of it about 5 years ago. I had seen the film thousands of times, had loved it, but I never really knew what it meant. During the course of the production, I suddenly felt alive. I felt that I wasn't having enough fun. I felt that I wasn't doing enough in my life. Crazy things, like kissing my mother or my father. I hadn't really hugged one of them in a while. It makes you think. It's more of a thinking person's film than a mere Christmas film. If you think it's just a Christmas film, I insist you watch it again and again, until you get the message.Stewart gives the finest performance of his career, in one of the most difficult characters ever portrayed. A character all of us are familiar with...a person looking to find himself\/herself. It's the great struggle for finding what it is in life you really want to do. George Bailey teaches us so lessons throughout the film and in the end he teaches us the most important lesson of all, that life, although a long and winding road, truly is (for lack of a better word) wonderful...",
            "Honestly, I don't think I've ever seen anything quite like It's A Wonderful Life.Does it take me back to that place in my heart, that makes me long for everything that once was great and it could be again? Does it remind me of my childhood, Christmas in my home? No. Maybe it's just simply what I always wanted from life and every man I want to be.Everything about this film is well for lack of better words, perfect. No question to it any longer, the best performance by an actor I have ever seen. It's more than just beautiful, timeless or fair. All of Stewart is revealed. Everything coming together for Capra. Lionel Barrymore at his best, which seems to be his worst.Sometimes I think there is a reason why somethings happen. And I'm pretty sure there is some magical reason why this film was made. I'm 27 years old and saw it for the first time Christmas Eve of this year. I've watched it 3 times since. The only movie to ever make me cry. I probably wouldn't have all the answers for you, if you asked me why. I'm still trying to figure Stewart out and just how beautiful was Reed.What can I say? This movie is a life changing experience.Makes me feel good to be alive. What a wonderful little world it is. And if I waited my entire life, it would not be a waste of time.",
            "I am a film lover from 'way back, having even served a stint as a newspaper movie critic. Entries in my personal list of Greatest Films of All Time include \"Fantasia,\" \"To Kill A Mockingbird,\" \"Casablanca,\" \"Singin' in the Rain,\" \"North by Northwest,\" and \"The Sound of Music. But sitting atop all of them, as undisputed champ, is \"It's a Wonderful Life.\"I have seen it hundreds of times (dating back to, oh, when I was a teenager I suppose, and our local PBS station ran it as part of a pledge drive). I drive my wife and family to distraction when we watch it together because I quote all the dialogue along with the actors.I cry every time--and this is after viewing upon viewing--when Harry Bailey toasts his big brother George as \"...the richest man in town.\" The emotions in that scene are so true and pure that I can't help but be affected by them.The performances are unparalleled. Stewart is brilliant as a small-town dreamer who loses and finds his way. His superlative acting abilities cause us to identify strongly with him (how many of us have lamented--even to ourselves--that no one seems to notice the sacrifices we've made?), which is, I think, why the movie bears up under so many repeat viewings. Reed is just lovely here, the epitome of sunny girlfriend, caring lover, devoted wife, dedicated mother.Capra's talent as a screenwriter are all over this script. He knows just how hard to tug the heartstrings without becoming overblown or phony. And his technical wizardry is evident too. I've never seen--before or since--more natural-looking onscreen snow.Watching IAWL has become a tonic, a pick-me-up when I really need one--whether it's the Christmas season or not. Its message--that each one of us is important and has *something* to contribute to the greater good--is one about which the world could use some reminding from time to time."
        ]
    },
    {
        "title":"The Silence of the Lambs",
        "url":"https:\/\/www.imdb.com\/title\/tt0102926\/",
        "rating":"8.6\/10",
        "plot":"A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.",
        "director":"Jonathan Demme",
        "cast":[
            "Jodie Foster",
            "Anthony Hopkins",
            "Scott Glenn",
            "Ted Levine",
            "Anthony Heald"
        ],
        "release_year":"1991",
        "duration":"1h 58m(118 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDdhOGJhYzctYzYwZC00YmI2LWI0MjctYjg4ODdlMDExYjBlXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
        "comments":[
            "This has to be the darkest and most brilliant film I have ever seen! The scene where Agent Starling is caught with the lights out has brought back my childish fears of the dark! Hopkins is one of the finest actors of our time. E-LECTORfying!",
            "This is definitely a film that proves you don't need tons of blood and gore to have a good suspense film.  Anthony Hopkins performance as the deranged genius Lecter earned him a well deserved Academy Award and the same was true of Jodie Foster's performance as Clarice Starling.  This film should go down in history as one of the greatest suspense films in the history of cinema.",
            "I first saw this in the early 90s on a vhs and i still remember how two very old ladies were petrified n blabbering about the movie to my dad and one thing which stayed with me after that conversation was the praising of Hopkins acting by the two grumbling old geezers.I revisited it in the early 2k on a dvd which I own and was in awe by Hopkins mesmerizing performance.Revisited it the third time today but this time with my kids as they are 18 now but my wife is still not agreeable.Everything has been said about this first class thriller n there seems to be nothing left but i jus wanna contribute a lil by praising the performance of Hopkins.In the entire movie, it is Hopkins' screen presence n footage which keeps u glued.His character is charismatic but very dangerous that u don't wanna be rude with him.Some scenes are far fetched but like i said it is the mesmerizing performance by Anthony Hopkins which is the highlight."
        ]
    },
    {
        "title":"Seven Samurai",
        "url":"https:\/\/www.imdb.com\/title\/tt0047478\/",
        "rating":"8.6\/10",
        "plot":"Farmers from a village exploited by bandits hire a veteran samurai for protection, and he gathers six other samurai to join him.",
        "director":"Akira Kurosawa",
        "cast":[
            "Toshirô Mifune",
            "Takashi Shimura",
            "Keiko Tsushima",
            "Yukiko Shimazaki",
            "Kamatari Fujiwara"
        ],
        "release_year":"1954",
        "duration":"3h 27m(207 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZjliMWExOTMtZDQ3ZS00NWU3LWIyN2EtMjllNzk3ZTNlYzg4XkEyXkFqcGc@._V1_QL75_UY281_CR5,0,190,281_.jpg",
        "comments":[
            "Having seen Kurosawa's Seven Samurai at least 10 times, I still see something new every time I watch it.  I don't see how anyone, especially a non-Japanese, could possibly absorb this movie in less than 2 or 3 viewings. I've always been surprised at how each of the 7 samurai can make such an individual impression on you even if you can't understand Japanese. Although Toshiro Mifune is often considered the star, for me its Takashi Shimura who is firmly fixed at the center of the movie.  He is the guiding moral force from the moment of his appearance in the film and can capture the viewer's attention in a way similar to Alec Guinness.  Mifune's character can be annoying at first in his loutish behavior, but he gains stature throughout the film and eventually becomes a unifying force second only to Shimura.  Minoru Chiaki as the woodcutting samurai provides a subtle humor and the others look to him to boost their morale.  Daisuke Kato is another very familiar face to Japanese movie fans and provides an excellent foil to Shimura as his second in command.  Yoshio Inaba is very good as the samurai who is recruited by Shimura and quickly builds a strong rapport with him.  Seiji Miyaguchi as the \"expert\" warrior, dedicated to honing his skill as a swordsman is a very low key yet likeable character.  Ko Kimura as the young hero-worshipping samurai, as well as the love interest of the peasant girl, wishes to be a great samurai, but is easily distracted by a field of flowers or a pretty face.  The peasants in the village being defended by the samurai each have their own defining characteristics as well.In addition to the wealth of interesting characters, we have a terrific action plot--the defending of the village from 40 marauding bandits by the small troop of samurai--, and a more subtle secondary plot involving the distrust of the samurai by the villagers due to the historical interaction of these two classes in feudal Japan.  All of these plot and character elements are woven together into an unforgettable epic, but, at least in my opinion, its not one that can be absorbed in a single sitting.  While it's similar in this sense to another of my favorite epics, Leone's Once Upon a Time in the West, it is more complex given the number of characters.I can only say that your patience with this film will probably be well rewarded if you take the time to give it multiple viewings.  You will also have the pleasure of seeing many of the samurai and villagers pop up in other Kurosawa films and films of other Japanese directors.  If you like Mifune and Shimura in this one, catch them in Stray Dog and Drunken Angel in very different settings and parts.This one is 10 out of 10 without a doubt.",
            "Akira Kurosawa's masterpiece... The Japanese equivalent to Orson Welles' Citizen Kane.. I say it's just as good, if not even better. Not only Kurosawa's most well known film, but the most widely recognized Japanese film ever made. This movie will forever be known as a milestone in motion picture history.The story revolves around a village that has become a group of bandits' common looting and pillaging ground. The villagers cannot take this any longer and go to town to hire warriors to defend the village from the bandits. A wandering ronin, Kambei (Takashi Shimura) agrees to help them and with his help, they recruit six others that agree to take the job. The seven samurai teach the villagers how to stand up to the bandits and defend themselves. Finally, when the time comes, they engage in a fierce battle with the attacking bandits.About once in every 20 years or so we are gifted with a film that has the meaning, power, richness, and technique that The Seven Samurai has. I cannot urge anyone enough to see this film, the images are true cinematic poetry rich with so much emotion that I cannot even describe them in words. If you have never seen any of Kurosawa's works, then please see Seven Samurai... you will witness the true beauty, excellence and magic that the art form known as film is capable of.",
            "I discovered 16 of Kurosawa's best known films before returning to the one which is commonly thought of as his masterpiece. Seven Samurai is unlike any other grand classic ever produced. It's basic plot can be summed up in a single easy sentence, yet its refinement and execution rival any movie you've ever seen.The premise: in chaotic 16th century Japan, as marauders threaten raid villages, one village hires samurai to defend it from a group of bandits. Yet Kurosawa (also co-writer) developed these characters in a way unheard of for what might pass as an epic action film. To its astonishing credit, through all of its 207 minutes running time, Seven Samurai never falters or bores. And if the script is a marvel in itself, the acting and production design than derive from it are nothing short of superlative. It is said that Kurosawa forced the villagers (from supporting role to mere extra) to live together as a community during production and be their characters, each and every one of which he had drawn out specifically. This unusual technique gave Seven Samurai a feel of authenticity unparalleled in film history.The samurai themselves are so richly given life to in the screenplay that little more would have been needed to make them memorable characters, yet the main cast pay off at every turn, and though every one of the seven main actors give in perfect performances (never as I had feared before watching it do you confuse them, even in the chaotic battle scenes), two immortal roles have a particularly resounding effect: Takashi Shimura (Kambei Shimada), who plays the leader of the ragged band of samurai, gives his sage and venerable warrior a god-like intensity that makes the magnetic charisma of his character unquestionable. One of the easiest leaders to root for in all the history of film-making. Stealing the show however, albeit by a very thin margin, is longtime Kurosawa favorite coworker Toshiro Mifune (Kikuchiyo) as the rogue seventh, the black sheep of the herd, giving the bravura ultimate performance of a lifetime paved throughout with great roles.The story follows them and the villagers, equally nuanced and developed, through their encounter, training, eventual bonding and the big inevitable fight for survival. Unlike subsequent very successful remakes (i.e. Magnificent Seven), seven Samurai transcended excellency by having many layers (nothing or no one is white or black: everything exists in shades of gray) and thus being very real and human. Even without the menace, its interpersonal dynamics would have made it perfect human drama, subtle, balancing comedy, intensity, realism, drama and a deep philosophy with astonishing ease, yet the menace does materialize and thus Seven Samurai unleashes its violence in a series of action scenes crafted with such vision and ingenuity as has ever reached an action film (the frenetic battle scenes at the end rather evoke Saving Private Ryan in their relentlessness).In the end, what made this into solid gold was, at the core, Akira Kurosawa, who would, despite directing many further masterpieces (Throne of Blood, Yojimbo, Red Beard, Dersu Uzala, Kagemusha, Ran), would never top this one. Throughout his life, Kurosawa kept confirming his status as perhaps the greatest director ever. If so, Seven Samurai is the ultimate proof of that truth. One of the very best films ever made and personal all-time favorite."
        ]
    },
    {
        "title":"Saving Private Ryan",
        "url":"https:\/\/www.imdb.com\/title\/tt0120815\/",
        "rating":"8.6\/10",
        "plot":"Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose comrades have been killed in action.",
        "director":"Steven Spielberg",
        "cast":[
            "Tom Hanks",
            "Matt Damon",
            "Tom Sizemore",
            "Edward Burns",
            "Barry Pepper"
        ],
        "release_year":"1998",
        "duration":"2h 49m(169 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZGZhZGQ1ZWUtZTZjYS00MDJhLWFkYjctN2ZlYjE5NWYwZDM2XkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
        "comments":[
            "21 years ago this movie was released and I finally watched it in 2019. I really struggled to watch and I cried and I wept through most of the movie. I did two tours in Nam. This movie was like being back in country. I will never watch it again. It's just eats my guts out.",
            "This film is an absolute masterpiece. It shows that war isn't always glamorous. Steven Spielberg won a Best Directing Oscar for his work on this film and the film went on to win four others. It is gritty and bloody and it shows that wars aren't won by weapons but by soldiers. The cast shine as the group of soldiers tasked with finding Private Ryan. Along the way they encounter the harsh truth and real meaning of war. It boasts impressive battle sequences and the stylish cinematography makes the film truly beautiful. The opening beach sequence is possibly the greatest opening scenes in movies. Tom Hanks is spell binding as the commander who has no idea about the harsh truth of war. Overall a truly amazing film.",
            "My grandfather fought in WW2 somehow surviving D-Day. He was apart of Operation Neptune and stormed the beaches of Normandy. He told us a lot of war stories but rarely ever spoke about that day. Before he passed away he did an interview with a local newspaper and detailed what he saw despite it being very difficult for him to speak about. He loved watching war movies... not sure exactly why. Some about that soldier life never really leaves them I guess. He absolutely hated Pearl Harbor cause of the horrible way they portray the military to be a bunch of toothbrush wielding babies who don't know what to do in the event of being attacked. He had a friend stationed there who lost his life and thinks that movie is a disgusting display of ignorance. Soldiers don't take girlfriends on private plane rides. And they most definitely know how to swim. Maybe I'll give that movie a good ripping one day.But Saving Private Ryan was a respectable \"I can't watch this\" reaction. He said no movie has come that close to capturing what that day was like. He said it was too realistic. Whether or not the story is based on real or fiction, that intro was 100% realistic. I'm not sure if he ever did finish watching it but he appreciated it for capturing that chaos like no other movie has before. I watched the movie a dozen times now and keep it in my collection as a reminder of my grandfather. A scene he was technically in. Which makes me appreciate how strong of a person he really is.War is hell and this movie not only shows that while being an entertaining experience but also captured what soldiers are left behind with. My grandfather was not afraid of anything. I've seen this man walk into a cellar full of black widows to get firewood and not even shake them off. The only time he ever experienced fear was when he went to bed. His nightmares of his time during the war would haunt him in his sleep. This movie helped me understand why."
        ]
    },
    {
        "title":"The Green Mile",
        "url":"https:\/\/www.imdb.com\/title\/tt0120689\/",
        "rating":"8.6\/10",
        "plot":"A death row guard learns that a gentle giant in his charge possesses a mysterious gift.",
        "director":"Frank Darabont",
        "cast":[
            "Tom Hanks",
            "Michael Clarke Duncan",
            "David Morse",
            "Bonnie Hunt",
            "James Cromwell"
        ],
        "release_year":"1999",
        "duration":"3h 9m(189 min)",
        "image_url":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTUxMzQyNjA5MF5BMl5BanBnXkFtZTYwOTU2NTY3._V1_QL75_UX190_CR0,0,190,281_.jpg",
        "comments":[
            "GREATEST FILM I HAVE EVER SEEN. i remember seeing it when it first came out when i was 12 years old. now i just finished watching it and have gone through practically a whole box of tissues...that pure, love and honesty was portrayed so exquisitely well by Michael Clarke Duncan... it made me want to tear my hair out. If there is anything in this world which reminds me of true human love and compassion, it is this film. If you ever give up hope on humanity and the destruction which our disgusting race has brought to this world, watch \"The Green Mile\" Hopefully it will change your outlook a little bit like it just has mine.11\/10 SHOULD HAVE WON ALL THE AWARDS AVAILABLE THE YEAR OF IT'S RELEASE.",
            "This movie was spectacular!!  I was watching it intently from beginning to end and did not even notice the time.  This movie is a true masterpiece. Tom Hanks and Michael Clarke Duncan were wonderful and the supporting cast was fantastic.Based on a serial novel by Stephen King, the Green Mile is about Paul Edgecomb, a officer in charge of prisoners on death row and everything was the same as usual until the day that John Coffey (Clarke Duncan) was brought to the mile.  Coffey is an extraordinary person and Paul Edgecomb never believed in miracles until the day he met one.This movie is one of the best adaptations of a Stephen King novel that I have ever seen.  I think that I would recommend this movie to everyone, and even if you don't like King's work I am certain that you will love this flick.  This movie was robbed at the Academy Awards, but never the less, it is still one of the most memorable movies I have ever seen.  A small warning though, if you are a bit squeemish then you may need to hide your eyes for a few scenes, but don't miss out on this movie because of it.  I give this movie a 9.5 out of 10!!!",
            "The Green Mile is a masterwork. This is film as art, at it's very best. The depth of the cast is extraordinary, with all of the players delivering excellent performances. There is a clear sense here that all involved in the production knew that this was something special, and gave it their all. See this film if you truly enjoy actors giving everything to their craft. Watch for the countless subtleties of expression, and the great power that the cast creates with silence. This is evident in the opening sequence and remains throughout. Above all, Michael Duncan as John Coffey is exceptional. He brings gripping emotion to a unique, fascinating character.The Green Mile should bring you joy, laughter, and if you are like most in the theater this night, tears.BRAVO!"
        ]
    }
]